{
  "body": {
    "Ectomorph": {
      "paragraph": "You are naturally light, quick, sensitive, and mentally active. Your body responds fast to change, and so does your mind. You may find it hard to gain weight, and energy may fluctuate.",
      "commonFeeling": "Sometimes my mind is ahead of my body.",
      "tip": "Eat warm, cooked foods and keep a steady meal routine."
    },
    "Mesomorph": {
      "paragraph": "You are naturally strong, athletic, and focused. Your digestion is usually good, and your body responds well to routines. You have an inner fire and drive that makes you disciplined.",
      "commonFeeling": "My energy is strong but sometimes overheats.",
      "tip": "Keep meals non-spicy and avoid skipping meals."
    },
    "Endomorph": {
      "paragraph": "You are naturally grounded, steady, supportive, and emotionally warm. Your body holds energy well, but sometimes this turns into heaviness.",
      "commonFeeling": "I start slow but remain steady.",
      "tip": "Start your morning with movement before eating."
    }
  },
  "modifiers": {
    "Ectomorph": {
      "Pitta": "You feel light but also driven, sharp, and intense.",
      "Kapha": "You feel light but sometimes get tired easily or feel low energy."
    },
    "Mesomorph": {
      "Vata": "You feel strong but also get restless or overstimulated.",
      "Kapha": "You feel strong but also experience heaviness or cravings at times."
    },
    "Endomorph": {
      "Vata": "Heaviness with restlessness or anxiety.",
      "Pitta": "Heaviness with internal heat, irritation, or acidity."
    }
  },
  "prakriti": {
    "Vata": {
      "paragraph": "You are creative, intuitive, imaginative, fast-thinking, and emotionally sensitive. You notice things others miss.",
      "strengths": [
        "Quick learner",
        "Creative mind",
        "Empathetic"
      ],
      "tip": "Warmth + routine stabilizes you."
    },
    "Pitta": {
      "paragraph": "You are driven, focused, practical, disciplined, and passionate. You like clarity and purpose.",
      "strengths": [
        "Leadership",
        "Determination",
        "Problem-solving"
      ],
      "tip": "Cooling foods calm your inner fire."
    },
    "Kapha": {
      "paragraph": "You are nurturing, patient, loyal, kind, and emotionally deep. People trust you quickly.",
      "strengths": [
        "Stability",
        "Compassion",
        "Endurance"
      ],
      "tip": "Movement + warmth keeps you energized."
    }
  },
  "prakritiModifiers": {
    "Vata": {
      "Pitta": "Creative + sharp — beautiful combination but needs cooling.",
      "Kapha": "Creative + steady — needs stimulation to avoid stagnation."
    },
    "Pitta": {
      "Vata": "Driven + restless — powerful but needs grounding.",
      "Kapha": "Driven + steady — powerhouse but needs lightness."
    },
    "Kapha": {
      "Vata": "Nurturing + sensitive — needs grounding.",
      "Pitta": "Nurturing + strong — needs cooling."
    }
  },
  "vikriti": {
    "Vata": {
      "paragraph": "You may feel restless, anxious, overwhelmed, or mentally overactive. Your body may feel cold, sensitive, or irregular.",
      "quickTip": "Warm foods + early dinners + grounding breathwork.",
      "empathyLine": "Your system feels restless and needs grounding."
    },
    "Pitta": {
      "paragraph": "You may feel irritated, heated, acidic, impatient, or mentally overdriven.",
      "quickTip": "Cool down your system — avoid spicy food for 48 hours.",
      "empathyLine": "Your system is heated — cool and calm routines will help."
    },
    "Kapha": {
      "paragraph": "You may feel heavy, dull, emotionally low, or low on energy.",
      "quickTip": "Warm water + movement first thing in morning.",
      "empathyLine": "Your system feels heavy — warmth, movement and light foods will help."
    },
    "Vata-Pitta": {
      "paragraph": "You may feel restless + irritated together — tired but unable to relax.",
      "quickTip": "Warm, soft meals; no spicy foods for the next 48 hours.",
      "empathyLine": "Restless and heated — ground + cool."
    },
    "Pitta-Vata": {
      "paragraph": "You may feel overwhelmed + overheated — anxious but triggered easily.",
      "quickTip": "Cool the body; slow the mind.",
      "empathyLine": "Heated and restless — cool + ground."
    },
    "Pitta-Kapha": {
      "paragraph": "Heat trapped under heaviness — frustration mixing with emotional weight.",
      "quickTip": "Light dinners + avoid spicy food.",
      "empathyLine": "Heated and heavy — cool + move."
    },
    "Kapha-Pitta": {
      "paragraph": "Feeling stuck but irritated; heavy inside and hot inside.",
      "quickTip": "Warm morning routine + light meals.",
      "empathyLine": "Heavy and heated — move + cool."
    },
    "Vata-Kapha": {
      "paragraph": "Restless mind + heavy body — wanting to move but unable to start.",
      "quickTip": "Warm water + 20 min walk today.",
      "empathyLine": "Restless yet heavy — ground + move."
    },
    "Kapha-Vata": {
      "paragraph": "Heavy body + anxious mind — emotional weight plus mental restlessness.",
      "quickTip": "Warm, light meals + grounding breath.",
      "empathyLine": "Heavy yet restless — move + ground."
    },
    "Balanced": {
      "paragraph": "Your current Vikriti shows a balanced state, with all three doshas working in harmony. This indicates good overall health and balance in your system. Continue maintaining your current routines, diet, and lifestyle practices that support this equilibrium.",
      "quickTip": "Maintain your current balanced routines and lifestyle practices.",
      "empathyLine": "You're well balanced — maintain your current routines."
    }
  },
  "paidPreview": {
    "text": "To help you heal deeply, I've created a personalized 14-day plan that includes: Food plan • Movement plan • Sleep guidance • Emotional healing ritual • 24-hour quick fix • Herb suggestions • What your body is REALLY trying to tell you",
    "features": [
      "Food plan",
      "Movement plan",
      "Sleep guidance",
      "Emotional healing ritual",
      "24-hour quick fix",
      "Herb suggestions",
      "What your body is REALLY trying to tell you"
    ]
  },
  "bodyCodeReports": {
    "B1": {
      "title": "🌬 Aero Energy Body: \"The Lightflow Build\"",
      "subtitle": "(Pure Aero — light frame, fast mind, sensitive digestion)",
      "howYourBodyLives": "How your body actually feels, day to day\nYou usually feel colder than people around you — especially your hands, feet, or stomach.\nEven when others feel fine, you may want warmth, socks, or something hot to drink.\nYour body also reacts quickly to change.\nIf your sleep timing shifts, meals get delayed, or travel disrupts routine, you don't just feel \"off\" —\nyou may feel tired, gassy, bloated, or uneasy the very same day.\nHunger doesn't follow the clock for you.\nThat's because your body energy rises and falls fast.\nSome days, your mind is busy and active — and hunger gets ignored.\nOther days, when energy suddenly drops, hunger hits strong and suddenly, almost like your body is saying:\n\"I need fuel right now.\"\nWhen meals are skipped or rushed, your stomach reacts first.",
      "howYourMindMoves": "How your mind really works\nYour mind moves fast — faster than most people around you.\n\nAn idea pops up while brushing your teeth.\nAnother while walking.\nAnother while talking to someone.\nYou get excited easily at the start of something new —\na plan, a project, a routine, a goal.\nBut if there's no structure holding you, the energy slowly fades.\nYou may leave things unfinished — not because you don't care,\nbut because your energy runs out before the idea does.\n\nWhat drains you without you realizing it\nYou notice everything.\nSmall changes in tone.\nSomeone's mood in the room.\nBackground noise.\nEmotional tension — even when no one says anything.\nYou may not react openly.\nBut by evening, you feel tired, heavy, or mentally full.\nYou sometimes wonder:\n\"I didn't do much today... so why do I feel so exhausted?\"\nIt's because your system takes in more than it shows.",
      "howStressShowsUp": "How stress shows up in your body\nYou don't always feel stressed as \"worry\" in your head.\nInstead, your body shows it clearly:\n• Stomach tightness or uneasiness\n• Difficulty switching off your thoughts at night\n• Sudden energy drops during the day\nYour body reacts first — even before you consciously realize you're under pressure.",
      "earlySignals": [
        "Feeling cold easily",
        "Dry skin or lips",
        "Light or disturbed sleep",
        "Sudden tiredness without reason",
        "Feeling noticeably better after warm food or warmth"
      ],
      "dailyAnchors": [
        "Warm, cooked meals calm your digestion",
        "Fixed meal and sleep timings stabilize energy",
        "Slow, grounding movement keeps your mind steady"
      ],
      "closingMessage": "The simple truth about you\nYou are not weak.\nYou are not inconsistent.\nYou are highly sensitive to change — and that is your strength and your responsibility.\nWhen you give your body warmth, routine, and calm:\n• Your energy lasts longer\n• Your digestion improves\n• Your mind feels clearer\nYour body doesn't need to be pushed.\nIt needs to be supported."
    },
    "B2": {
      "title": "🌬🔥 Aero–Pyro Energy Body: \"The Lightfire Build\"",
      "subtitle": "(Light body • fast reactions • heat under pressure)",
      "howYourBodyLives": "This is how your body feels, day to day\nYour body feels light and quick, meaning you can move easily, stay active, and don't feel weighed down.\nAt the same time, you're not weak — you usually handle work and activity well when things are on time.\nBut your body does not like delays.\nIf meals are late, sleep is pushed, or work stretches too long, your body reacts the same day.\nYou may feel acidity, headache, stomach discomfort, or sudden irritation — not because something is wrong, but because your system needs timely support.",
      "howYourMindWorks": "This is how your mind usually works\nYour mind likes clear plans, quick action, and visible results.\nFor example, you prefer:\n• Clear instructions over vague discussions\n• Finishing a task quickly rather than dragging it\n• Deciding fast instead of going back and forth\nYou feel satisfied when things move forward.\nYou feel uncomfortable when things are slow, confusing, or stuck.\n\nWhat quietly drains you\nYou don't like stopping midway.\nYou keep working even when tired.\nYou delay eating to \"finish one more thing\".\nYou push yourself to complete tasks instead of pausing.\nThis creates constant internal pressure —\nmeaning your mind stays active even when your body needs rest.\nOver time, this leads to irritability, restlessness, or sudden frustration.",
      "howStressShowsUp": "How stress shows up physically\nStress doesn't stay only in your thoughts.\nIt shows up in your body as:\n\n• Burning or sour feeling in the stomach\n• Headaches when meals are late\n• Tightness in the chest, jaw, or head\n• Light or disturbed sleep on busy days\nYour body reacts fast when food and rest are delayed under pressure.",
      "earlySignals": [
        "Hunger that suddenly feels urgent",
        "Acidity or burning sensation",
        "Headache if meals are skipped",
        "Difficulty relaxing at night",
        "Feeling irritable when hungry"
      ],
      "dailyAnchors": [
        "Eat as soon as hunger starts — don't stretch it",
        "Choose simple, warm food instead of very spicy food",
        "Slow down after sunset — fewer tasks, less noise"
      ],
      "closingMessage": "One grounding truth\nYour body works best when food, rest, and work happen on time.\nWhen you support timing, your energy stays strong without turning into irritation."
    },
    "B3": {
      "title": "🌬🌧 Aero–Geo Energy Body: \"The Lightearth Build\"",
      "subtitle": "(Light body appearance • slow, heavy response inside)",
      "howYourBodyLives": "This is how your body feels, day to day\nYour body looks slim or light, but it doesn't always behave that way inside.\nEven if you eat small amounts, your body can still feel heavy or loaded, especially when you sit a lot or your routine becomes slow.\nYour digestion prefers warm food and fixed meal times.\nIf meals are cold, late, or irregular, food feels like it just sits there — you feel full for a long time and digestion feels slow.\nYou don't feel hungry quickly.\nBut once heaviness builds up in your stomach or body, it doesn't clear easily.",
      "howYourMindWorks": "This is how your mind usually works\nYou don't jump into things immediately.\nFor example:\n• You know you need to start a task, but you wait till you \"feel okay\"\n• You postpone starting until your mood feels settled\n• You work better when you feel emotionally comfortable\nThis doesn't mean you're lazy.\nIt means your mind moves only when it feels safe and settled inside.\nWhen that inner comfort is missing, starting anything feels harder than it should.\n\nWhat quietly drains you\nWhat drains you most is carrying emotional weight.\nSituations that feel heavy, tense, or emotionally demanding make you pull back.\nInstead of reacting, you slow down or withdraw.\nDuring such times, food feels comforting — not because you're hungry, but because it feels soothing.\nSlowly, this adds to:\n• Physical heaviness\n• Low mood\n• Reduced motivation",
      "howStressShowsUp": "How stress shows up physically\nStress affects you in two ways at the same time.\nYour body slows down:\n• Digestion becomes sluggish\n• Energy drops\n• Body feels heavy\nBut your mind doesn't fully stop.\nThoughts continue, especially at night.\nYou may sleep for long hours, yet wake up feeling tired or dull.",
      "earlySignals": [
        "Feeling heavy or lazy on waking up",
        "Not feeling hungry in the morning",
        "Feeling full for too long after meals",
        "Gas and slow digestion",
        "Wanting sweets when emotionally tired",
        "Mind staying active at bedtime"
      ],
      "dailyAnchors": [
        "Light movement before breakfast helps wake digestion",
        "Eating a lighter dinner reduces next-day heaviness",
        "Warm meals are easier for your system to handle",
        "Warm water helps reduce the \"stuck\" feeling inside"
      ],
      "closingMessage": "One grounding truth\nYour body feels better when it moves a little every day.\nYour mind feels better when it is treated gently.\nWhen both happen together, heaviness slowly lifts."
    },
    "B4": {
      "title": "🔥 Pyro Energy Body: \"The Fireform Build\"",
      "subtitle": "(Strong body • fast digestion • heat-sensitive system)",
      "howYourBodyLives": "This is how your body feels, day to day\nYour body feels strong and active.\nYou usually have:\n• Good muscle tone\n• Clear or sensitive skin\n• Good stamina\nHunger comes on time and feels strong.\nYour body expects food regularly.\nIf meals are delayed, skipped, or irregular, your body reacts quickly.\nYou may feel acidity, burning in the stomach, or a sense of heat in the body — often the same day.",
      "howYourMindWorks": "This is how your mind usually works\nYour mind likes clarity and direction.\nYou prefer:\n• Clear goals\n• Quick decisions\n• Finishing tasks properly\n\nWhen others feel confused, you naturally step in to organize or lead.\nYou often take responsibility — sometimes even when it's not fully yours.\nWhen things feel slow, unfair, or poorly managed, it bothers you more than most people.\n\nWhat quietly drains you\nWhat drains you most is inefficiency and lack of control.\nWaiting, repeated mistakes, or unclear communication irritate you internally.\nEven if you don't say it out loud, your body feels the tension.\nOver time, this inner irritation builds up as physical heat — not tiredness.",
      "howStressShowsUp": "How stress shows up physically\nStress shows up first in your body, not as sadness or fear.\nYou may notice:\n• Acidity or burning sensation\n• Headaches\n• Warmth or flushing in the face or body\n• Tight jaw or neck\nYour body reacts strongly when pressure increases and meals or rest are delayed.",
      "earlySignals": [
        "Burning or sour feeling in the stomach",
        "Skin becoming sensitive or irritated",
        "Feeling unusually warm at night",
        "Sudden anger or impatience",
        "Hunger that feels urgent and uncomfortable"
      ],
      "dailyAnchors": [
        "Eat meals on time — don't skip or delay",
        "Choose cooling foods like cucumber, coconut, or mint",
        "Avoid very spicy or fried food, especially when stressed",
        "Keep evenings calm and quiet"
      ],
      "closingMessage": "One grounding truth\nYour strength comes from strong energy and focus.\nThat same strength needs cooling and balance to stay healthy.\nWhen you respect timing and rest, your fire works for you — not against you."
    },
    "B5": {
      "title": "🔥🌬 Pyro–Aero Energy Body: \"The Fireflow Build\"",
      "subtitle": "(Strong body • fast mind • easily overworked system)",
      "howYourBodyLives": "This is how your body feels, day to day\nYour body feels strong, active, and capable.\nYou usually have good stamina and an athletic build.\nDigestion works well when you're calm and eating on time.\nBut when life becomes fast and stressful together —\nfor example, rushing to meet deadlines, multitasking while skipping meals, or working long hours without breaks —\nyour body struggles.\nIn such situations, you may feel acidity, gas, bloating, or sudden loss of appetite on the same day.",
      "howYourMindWorks": "This is how your mind usually works\nYour mind works fast and sharply.\nYou:\n\n• Solve problems quickly\n• Decide fast\n• Like finishing things properly\nEven when you sit down to rest, your mind is already planning the next task.\nBecause of this, stopping feels uncomfortable.\nIf you stop working, you may feel restless, impatient, or mentally unsettled — as if you should be doing something.\nOver time, this makes true rest difficult, even when your body is tired.\n\nWhat quietly drains you\nWhat drains you most is constant pushing.\nYou keep going even when:\n• Your body feels tired\n• Hunger feels low\n• Sleep has been reduced\nYou tell yourself, \"I'll rest after this is done.\"\nBut when this happens repeatedly, your energy doesn't fade slowly —\nit drops suddenly.\nThis can show up as:\n• Sudden exhaustion\n• Irritability\n• Feeling mentally alert but physically drained",
      "howStressShowsUp": "How stress shows up physically\nDeadlines, pressure, and mental load affect you both mentally and physically.\nYou may feel:\n• Light or broken sleep\n• Waking up suddenly at night with thoughts racing\n• Tightness in the chest or throat during stress\n• Acidity or uneasy digestion on busy days\nYour nervous system stays \"on\", and your stomach reacts along with it.",
      "earlySignals": [
        "Tight feeling in the throat or chest during stress",
        "Acidity along with bloating",
        "Waking up around 2–3 AM",
        "Mood shifting quickly from calm to irritated",
        "Reaching for tea, coffee, or sugar to keep going"
      ],
      "dailyAnchors": [
        "Eat slowly and chew properly",
        "Decide a fixed time to stop work in the evening",
        "Avoid intense workouts late at night",
        "When tired, reduce caffeine instead of increasing it"
      ],
      "closingMessage": "One grounding truth\nYour strength is speed and drive.\nYour stability comes from planned pauses.\nWhen you slow down at the right time, your body supports you better."
    },
    "B6": {
      "title": "🔥🌧 Pyro–Geo Energy Body: \"The Fireearth Build\"",
      "subtitle": "(Strong body • steady nature • stored heat under calm surface)",
      "howYourBodyLives": "This is how your body feels, day to day\nYour body feels strong and solid.\nWhen things are going well, you feel stable and capable.\nBut when food is heavy, oily, spicy, or eaten late, two things happen together:\n\n• You feel heat — acidity, burning, or warmth in the stomach\n• You feel heaviness — fullness, sleepiness, or a heavy body feeling\nFor example:\nAfter a heavy or late dinner, you may feel heartburn and feel sluggish or sleepy at the same time.\nThis is what it means when your body holds heat and heaviness together.",
      "howYourMindWorks": "This is how your mind usually works\nYou are calm and patient most of the time.\nBut when you feel pushed, ignored, or treated unfairly, your reaction becomes strong.\nYou care deeply about people, work quality, and responsibility.\nOften, you protect others:\n• You take on extra work\n• You hold back your own irritation\n• You avoid conflict to keep peace\nThis means you sometimes ignore your own needs.\n\nWhat quietly drains you\nWhat drains you most is holding things in.\nYou don't express irritation immediately.\nYou stay composed and handle things quietly.\nBut this irritation doesn't disappear.\nIt slowly builds up inside.\nOver time, this leads to:\n• Emotional eating\n• Mental heaviness\n• Feeling stuck or burdened",
      "howStressShowsUp": "How stress shows up physically\nStress affects your system in a similar way.\n\nWhen you are stressed — such as handling too much responsibility, holding back irritation, or dealing with emotional pressure — your body reacts in two ways:\n• Heat increases → acidity, headaches, inner restlessness\n• Heaviness increases → tiredness, mental dullness, craving comfort food\nFor example:\nOn a stressful day, you may feel irritated and have acidity, and later crave sweets or heavy food and feel sluggish.\nThis shows that stress increases both heat and heaviness at the same time in your body.",
      "earlySignals": [
        "Puffy face or fingers in the morning",
        "Burning sensation after oily or spicy food",
        "Slow, heavy start to the day",
        "Feeling mentally stuck when overwhelmed",
        "Strong desire for sweets during emotional stress"
      ],
      "dailyAnchors": [
        "Eat warm but mildly spiced food",
        "Avoid very oily, spicy, or late meals",
        "Move your body for 20–30 minutes in the morning",
        "Keep dinner light and early"
      ],
      "closingMessage": "One grounding truth\nYour steadiness is your strength.\nBut when you carry too much, it turns into discomfort.\nLightening the load helps your strength stay healthy."
    },
    "B7": {
      "title": "🌧 Geo Energy Body: \"The Earthform Build\"",
      "subtitle": "(Stable body • steady mind • slow metabolism)",
      "howYourBodyLives": "This is how your body feels, day to day\nYour body feels strong, solid, and steady.\nYou tend to gain weight easily — not because you eat too much, but because your body is good at storing energy.\nEven small changes in diet or activity can reflect on your weight.\nDigestion works slowly but steadily.\nAfter meals, you may feel full for a long time, and energy may dip.\nMornings are usually slow.\nYou need time to fully wake up and feel active.",
      "howYourMindWorks": "This is how your mind usually works\nYour mind is calm and grounded.\nYou don't rush decisions.\nYou like to think things through, feel comfortable, and then act.\nYou enjoy routine, familiarity, and long-term relationships.\nSudden changes feel uncomfortable at first — you need time to trust new situations or people.\n\nWhat quietly drains you\nWhat drains you most is staying still for too long.\nToo much comfort, long sitting, or emotional attachment makes you withdraw.\nYou may delay starting things, even when you know they are important.\nSlowly, motivation drops and everything feels harder to begin.",
      "howStressShowsUp": "How stress shows up physically\nStress doesn't make you anxious or restless.\n\nInstead, it makes you slow and heavy.\nYou may notice:\n• Low motivation\n• Heaviness in the body\n• Desire to sleep more\n• Turning to food for comfort\nStress pushes your body further into \"slow mode\".",
      "earlySignals": [
        "Difficulty waking up in the morning",
        "Puffiness or water retention",
        "Feeling full for long after meals",
        "Sleepiness after eating",
        "Increased mucus, congestion, or heaviness"
      ],
      "dailyAnchors": [
        "Light movement before breakfast helps wake metabolism",
        "Warm, lightly spiced food improves digestion",
        "Avoid long daytime naps",
        "Keep meals lighter in the evening"
      ],
      "closingMessage": "One grounding truth\nYour steadiness is a strength.\nBut energy stays healthy only when it keeps moving.\nRegular movement keeps your body light and active."
    },
    "B8": {
      "title": "🌧🌬 Geo–Aero Energy Body: \"The Earthflow Build\"",
      "subtitle": "(Strong body • sensitive mind • uneven energy)",
      "howYourBodyLives": "This is how your body feels, day to day\nYour body feels strong, but energy is uneven.\nSome days you feel active and light.\nOther days, even without doing much, your body feels heavy and slow.\nThis usually happens when:\n• Your routine changes\n• Sleep timing shifts\n• Meals are irregular\n• You've been mentally stressed\nYour body reacts to unpredictability, even if you don't notice it consciously.\n\nWhen meals are cold, skipped, or taken at odd times, your stomach reacts\nFor example:\n• Skipping breakfast and eating late lunch\n• Eating cold food straight from the fridge\n• Eating dinner very late at night\n• Eating at different times every day\nIn these situations, digestion slows down and you may feel gas, bloating, or long-lasting discomfort.",
      "howYourMindWorks": "This is how your mind usually works\nInside, your mind processes details deeply.\nYou think about:\n• How something was said\n• The tone of the conversation\n• What the other person might have meant\n\nThis can lead to:\n• Replaying conversations in your head\n• Worrying about misunderstandings\n• Feeling mentally tired without obvious stress\n\nWhen emotions feel unclear, decision-making slows down\nFor example:\n• You delay replying to an important message\n• You postpone a decision even after having all the facts\n• You keep thinking, \"Let me think a bit more\"\nThis doesn't mean you're confused.\nIt means your mind wants emotional clarity, not just logical answers, before moving forward.\n\nWhat quietly drains you\nWhat drains you most is mental overload with no outlet.\nYou think a lot, but don't always express it.\nYou worry quietly instead of talking it out.\nOver time, this creates inner tension —\nyour mind feels busy, while your body feels tired and heavy.",
      "howStressShowsUp": "How stress shows up physically\nStress affects your mind and body in opposite ways.\nYour mind speeds up:\n• More thinking\n• More worrying\n• Difficulty switching off\nYour body slows down:\n• Low energy\n• Heaviness\n• Sluggish digestion\nYou may sleep for many hours but still wake up not feeling rested.",
      "earlySignals": [
        "Feeling heavy but restless at night",
        "Gas with slow digestion",
        "Craving sweets for comfort",
        "Feeling \"stuck\" but mentally worried",
        "Overthinking just before sleep"
      ],
      "dailyAnchors": [
        "Light morning movement, even a 15-minute walk",
        "Warm meals at fixed times",
        "Avoid cold or late dinners",
        "Reduce screen time 30–45 minutes before sleep"
      ],
      "closingMessage": "One grounding truth\nYour body needs movement.\nYour mind needs reassurance.\nWhen both are given gently, balance returns."
    },
    "B9": {
      "title": "🌧🔥 Geo–Pyro Energy Body: \"The Earthfire Build\"",
      "subtitle": "(Strong body • steady nature • stored heat under calm surface)",
      "howYourBodyLives": "This is how your body feels, day to day\nYour body feels strong and dependable.\n\nYou usually have a good appetite and can digest food well when life feels calm and routine is steady.\nBut when meals are heavy, oily, spicy, or when you are emotionally stressed, two things happen together:\n• You feel heat → acidity, burning, warmth in the body\n• You feel heaviness → fullness, sleepiness, sluggishness\nFor example:\nAfter a heavy meal during a stressful phase, you may feel heartburn and also feel tired or heavy for hours.\nWeight also tends to stick easily, especially during emotional or stressful periods.",
      "howYourMindWorks": "This is how your mind usually works (refined)\nOn the outside, you appear calm and composed.\nInside, you care deeply about people, responsibility, and doing things properly.\nYou want stability, respect for your efforts, and steady progress.\nWhen these needs are met, you feel settled and balanced.\nFor example, when your work is appreciated or your role is clear, you feel calm and steady.\nWhen these needs are ignored, emotions don't show immediately.\nFor example, when your effort goes unnoticed or your opinion is repeatedly overlooked, you don't react at once — but feelings slowly build inside.\n\nWhat quietly drains you (refined)\nYou don't express hurt or irritation immediately.\nTo keep peace or avoid arguments, you often stay silent.\nFor example:\n• You agree even when you're uncomfortable\n• You don't point out unfairness right away\n• You say \"it's okay\" when it actually isn't\nAt the moment, this helps avoid conflict.\nBut over time, unspoken feelings collect inside, making you feel heavy, tired, or emotionally burdened.",
      "howStressShowsUp": "How stress shows up physically\nStress doesn't make you restless or anxious.\nInstead, it builds up quietly and then shows up strongly in the body.\nYou may notice:\n• Heartburn or acidity\n• Headaches\n• Sudden heavy fatigue\n• Feeling hot and tired at the same time\nAnger or irritation may appear later, but when it does, it feels intense.",
      "earlySignals": [
        "Feeling heavy and warm after meals",
        "Puffy face or fingers in the morning",
        "Energy dropping in the afternoon",
        "Craving sweets or comfort food when emotional",
        "Staying silent even when something hurts"
      ],
      "dailyAnchors": [
        "Eat warm food but avoid very spicy meals",
        "Stop eating when you feel satisfied, not overly full",
        "Do 20–25 minutes of daily activity — mornings work best",
        "Create simple, predictable routines"
      ],
      "closingMessage": "One grounding truth\nYou are strong because you hold things together.\nBut holding too much turns into strain.\n\nMovement and lighter routines help your body release what it shouldn't store."
    }
  },
  "prakritiCodeReports": {
    "P1": {
      "title": "🌬 Aero Natural Nature",
      "subtitle": "Innate Mental & Emotional Style",
      "yourNaturalNature": "This is how your inner world feels, day to day\nBy nature, your mind prefers movement over stillness.\nEven in calm situations, thoughts keep flowing —\nideas, memories, plans, and \"what if\" possibilities arise naturally.\nSmall things leave an impression on you.\nA comment, a tone of voice, or a moment can stay in your mind longer than it would for others.\nThis can be a strength — you understand people and situations deeply.\nIt can also be draining — because your mind doesn't let go quickly.",
      "howYouThinkAndRespond": "This is how you naturally think\nYour mind works by creating connections.\nFor example:\n• One idea leads to another\n• A simple thought expands into a bigger picture\n• You see possibilities others may miss\nYou don't just notice events —\nyou automatically think about why they happened and what they could lead to next.\nThis thinking style has been with you for as long as you can remember.",
      "yourSuperpowers": [
        "Creative problem-solving",
        "Adaptability — you adjust faster than most",
        "Empathy — you \"catch\" emotions quickly",
        "People come to you for ideas and genuine connection."
      ],
      "whenThisGetsTooMuch": "What quietly drains you\nWhat drains you most is mental overload.\n\nToo many thoughts running together.\nToo many choices to weigh.\nToo many open ideas left unfinished.\nThis happens even when your day is physically easy.\nEven positive excitement becomes tiring when your mind doesn't get a pause.\n\nHow stress shows up in your behavior\nUnder stress, your thinking speeds up instead of slowing down.\nYou may:\n• Overthink small decisions\n• Replay conversations repeatedly\n• Jump from one thought to another\nThis can lead to feeling restless, unfocused, and mentally scattered.",
      "lifeStageAndSeasonSensitivity": "Late nights, winters, and major life transitions amplify Aero-nature — you feel more anxious, cold, and mentally drained.",
      "anchors": [
        "One task at a time",
        "Clear priorities",
        "Quiet time without input (no phone, no noise)"
      ],
      "anchorsTitle": "What helps you feel stable quickly",
      "closingMessage": "One grounding truth about you\nYour mind is naturally creative and active.\nBut it works best when it has clear boundaries.\nStructure doesn't limit you — it protects your mental peace."
    },
    "P2": {
      "title": "🌬🔥 Aero–Pyro Natural Nature",
      "subtitle": "The Lightfire Personality\n(Fast-thinking mind • high drive • direct expression)",
      "yourNaturalNature": "This is how your inner world feels, day to day (refined lines)\nWhen life feels purposeful, you feel alive.\nFor example, when you have a clear goal, challenge, or responsibility, your energy and focus rise naturally.\nWhen things slow down, you feel restless inside.\nFor example, during waiting periods, delays, or when there's nothing meaningful to work toward, your mind starts searching for something to do or fix.",
      "howYouThinkAndRespond": "This is how you naturally think (refined line)\nSometimes you say things before others are emotionally ready to hear them — not to hurt, but because clarity matters to you.\nThe consequence is that others may feel rushed, pressured, or misunderstood, even though your intention was honesty and efficiency.",
      "yourSuperpowers": [
        "Leadership + creativity together",
        "High ambition with sharp focus",
        "Ability to inspire and push others forward",
        "People rely on your drive — you make things happen."
      ],
      "whenThisGetsTooMuch": "What quietly drains you (refined line)\nYou push yourself hard because you expect a lot from yourself — sometimes more than is realistic.\nOver time, this can lead to:\n• Feeling constantly \"behind\" even when you've done a lot\n• Difficulty feeling satisfied with progress\n• Being hard on yourself instead of acknowledging effort\n\nHow stress shows up in your behavior (refined line)\nYour mind tries to solve pressure by doing more, not by slowing down.\nFor example:\n• You add more tasks instead of taking a break\n• You keep pushing forward even when tired\n• You think the solution is more effort, not rest\nThis increases inner pressure instead of reducing it.",
      "lifeStageAndSeasonSensitivity": "Hot weather and high-pressure phases increase heat + restlessness → short temper / sleeplessness.",
      "anchors": [
        "Brief pauses before responding",
        "Clear limits on how much you take on",
        "Planning recovery with the same seriousness as action"
      ],
      "anchorsTitle": "What helps you feel stable quickly",
      "closingMessage": "One grounding truth about you\nYour fire helps you lead, build, and move things forward.\nBut direction and pacing protect that fire.\nWhen speed and pause work together, you thrive."
    },
    "P3": {
      "title": "🌬🌧 Aero–Geo Natural Nature",
      "subtitle": "The Lightearth Personality\n(Sensitive awareness • steady emotional core)",
      "yourNaturalNature": "This is how your inner world feels, day to day\nBy nature, your inner world feels gentle and receptive.\nYou sense emotions easily — not just your own, but others' as well.\nOften, you understand how someone feels even before they say anything.\nYour thoughts move slowly and deeply, guided more by feelings than speed.\nYou prefer emotional safety over urgency.",
      "howYouThinkAndRespond": "This is how you naturally think\nYou think carefully and emotionally.\nFor example:\n• You take time before deciding\n• You wait until something feels right, not just logical\n• You don't like being rushed into choices\nYou value comfort, familiarity, and secure connections.\nOnce you trust someone or something, you stay committed.",
      "yourSuperpowers": [
        "Emotional intelligence",
        "Loyalty and reliability",
        "Calm presence in hectic situations",
        "People trust you because you genuinely care."
      ],
      "whenThisGetsTooMuch": "What quietly drains you\nWhat drains you most is emotional overload.\nWhen you keep listening, caring, and supporting without expressing your own feelings, it builds quietly inside.\nYou may put others first and postpone your own needs, thinking you'll handle them later.\n\nHow stress shows up in your behavior\nUnder stress, your response is to pull back rather than react.\n\nYou may:\n• Delay important tasks\n• Avoid difficult conversations\n• Withdraw quietly instead of expressing discomfort\nThis isn't avoidance — it's your way of protecting emotional balance.",
      "lifeStageAndSeasonSensitivity": "Cold/damp seasons and emotional upheavals increase heaviness in body + worry in mind.",
      "anchors": [
        "Talking or writing about what you feel",
        "Small, consistent actions instead of big pushes",
        "Reassuring routines and familiar environments"
      ],
      "anchorsTitle": "What helps you feel stable quickly",
      "closingMessage": "One grounding truth about you\nYour sensitivity is not weakness.\nIt's your strength.\nBut caring for others works best when you also care for yourself."
    },
    "P4": {
      "title": "🔥 Pyro Natural Nature",
      "subtitle": "The Fire Energy Personality\n(Focused mind • strong will • purpose-driven nature)",
      "yourNaturalNature": "This is how your inner world feels, day to day\nBy nature, your inner world feels direct and goal-oriented.\nYou feel most comfortable when things are clear —\nclear roles, clear expectations, clear direction.\nUncertainty or confusion creates inner tension, even if you don't show it outwardly. For example, when instructions are unclear at work, plans keep changing, or people avoid giving straight answers, you may stay quiet — but inside you feel uneasy and mentally unsettled until things become clear",
      "howYouThinkAndRespond": "This is how you naturally think\nYou naturally think in logic, structure, and outcomes. In simple terms, your mind asks:\n• What is the goal?\n• What is the best way to reach it?\n• What needs to be done first?\nYou prefer clear steps over emotional discussion and practical solutions over long debates\nFor example:\n• You quickly identify what matters and what doesn't\n• You prefer straight answers over emotional cushioning\n• You decide once you have enough information and then commit fully\nYou don't avoid emotions — but you don't let them block truth or progress.",
      "yourSuperpowers": [
        "Strong memory and sharp decision-making",
        "Leadership that makes others feel secure",
        "Courage to stand for what's right",
        "People trust you to get things done correctly."
      ],
      "whenThisGetsTooMuch": "What quietly drains you\nWhat drains you most is inefficiency and lack of integrity.\nHalf-done work.\nUnclear communication.\nAvoiding responsibility.\nYou may stay composed, but internally this builds frustration. Over time, this can lead to:\n• Feeling irritated without openly expressing it\n• Becoming mentally rigid\n• Losing patience faster than usual\n\nThe frustration doesn't disappear — it collects quietly\n\nHow stress shows up in your behavior\nUnder stress, your intensity increases.\nYou may:\n• Become impatient with delays\n• Push others (and yourself) harder\n• Feel a strong urge to correct or control situations\nYour mind tries to restore order by tightening focus. For example:\n• You take control of situations\n• You correct details others overlook\n• You push for faster decisions and clearer rules\nThis is your way of reducing chaos — by bringing structure and direction back",
      "lifeStageAndSeasonSensitivity": "Summer and peak career phases increase intensity — passion can overpower balance.",
      "anchors": [
        "Pausing before reacting",
        "Acknowledging effort, not just results",
        "Allowing room for different working styles"
      ],
      "anchorsTitle": "What helps you feel stable quickly",
      "closingMessage": "One grounding truth about you\nYour clarity and courage help things move forward.\nBut steadiness protects your leadership.\nWhen strength is guided by calm, you lead at your best."
    },
    "P5": {
      "title": "🔥🌬 Pyro–Aero Natural Nature",
      "subtitle": "The Fireflow Personality\n(High drive • fast mind • intensity-prone nature)",
      "yourNaturalNature": "This is how your inner world feels, day to day\nBy nature, your inner world feels charged and fast-moving.\nIn simple terms, your mind likes to stay active.\nYou feel best when you are busy, planning, executing, or improving something.\nFor example:\n• A free day feels uncomfortable\n• Silence makes your mind look for work\n• You naturally create tasks even when none are urgent\nYour inner energy wants movement.",
      "howYouThinkAndRespond": "This is how you naturally think\nYou naturally think in action-first mode.\nWhen an idea comes, you want to act immediately.\nWaiting feels uncomfortable because it feels like losing momentum.\nStillness often feels like wasted time to you.\nThe consequence is that you may keep yourself busy even when rest or reflection would help more.",
      "yourSuperpowers": [
        "Execution with creativity",
        "Can lead under pressure",
        "Quick learner, bold decision-maker",
        "People look to you when urgency matters."
      ],
      "whenThisGetsTooMuch": "What quietly drains you\nWhat drains you most is ignoring your own limits.\n\nFor example:\n• You continue working even when mentally tired\n• You take on more responsibilities because you \"can handle it\"\n• You postpone breaks because something still needs to be done\nAt first, this feels productive.\nOver time, it creates inner pressure and mental exhaustion.\n\nHow stress shows up in your behavior\nWhen pressure builds, your mind tries to escape it by doing more, not by slowing down.\nFor example:\n• You add new tasks instead of removing some\n• You push harder instead of pausing\n• You believe speed will solve the problem\nThis often leads to more pressure, not relief.",
      "lifeStageAndSeasonSensitivity": "Hot weather + overwork = irritability + internal heat + nervous tension.",
      "anchors": [
        "Choosing fewer priorities",
        "Allowing pauses without guilt",
        "Reminding yourself that rest supports performance"
      ],
      "anchorsTitle": "What helps you feel stable quickly",
      "closingMessage": "One grounding truth about you\nYour speed helps you move ahead quickly.\nBut pacing is what helps you stay strong long-term.\nWhen you slow down on purpose, your power lasts longer."
    },
    "P6": {
      "title": "🔥🌧 Pyro–Geo Natural Nature",
      "subtitle": "The Fireearth Personality\n(Strong will • emotional depth • responsibility-driven nature)",
      "yourNaturalNature": "This is how your inner world feels, day to day\nBy nature, your inner world feels serious and committed.\nYou take responsibility personally — not just for tasks, but for people and outcomes.\nWhen something matters to you, you carry it fully, not halfway.\nYou balance logic with care.\nYou don't rush emotionally, but once involved, you are deeply invested.",
      "howYouThinkAndRespond": "This is how you naturally think (refined explanation)\nYou don't like giving up — not because of ego, but because responsibility matters to you.\nIn simple terms, when you take something on, you feel it is your duty to see it through.\nEven if things become uncomfortable or emotionally difficult, you don't walk away easily because you don't want to let people or commitments down.\nFor example:\n• Once you say yes, you mean it\n• You stay even when things become difficult\n• You don't quit easily, even when hurt or disappointed\nYou don't like giving up — not because of ego, but because responsibility matters to you.",
      "yourSuperpowers": [
        "Consistency + willpower = solid results",
        "Emotional loyalty — relationships bloom with you",
        "Quiet leadership that others trust deeply",
        "People feel safe in your strength."
      ],
      "whenThisGetsTooMuch": "What quietly drains you\nYou prefer handling things yourself rather than burdening others.\n\nFor example, when you are stressed or hurt, you may think:\n• \"I'll manage\"\n• \"Others already have enough problems\"\n• \"No need to involve anyone\"\nSo instead of sharing, you carry it alone — which slowly becomes tiring.\n\nHow stress shows up in your behavior\nWhen pressure builds, your mind tries to escape it by doing more, not by slowing down.\nFor example:\n• You add new tasks instead of removing some\n• You push harder instead of pausing. This means you keep functioning normally on the outside —but inside, you collect pressure without talking about it.\n• You believe speed will solve the problem\nYou handle tasks, meet responsibilities, and appear steady, while stress builds quietly inside. This often leads to more pressure, not relief.",
      "lifeStageAndSeasonSensitivity": "Humidity and long stressful phases increase heaviness in body + heat in mind.",
      "anchors": [
        "Choosing fewer priorities",
        "Allowing pauses without guilt",
        "Reminding yourself that rest supports performance"
      ],
      "anchorsTitle": "What helps you feel stable quickly",
      "closingMessage": "One grounding truth about you\nYour speed helps you move ahead quickly.\nBut pacing is what helps you stay strong long-term.\nWhen you slow down on purpose, your power lasts longer."
    },
    "P7": {
      "title": "🌧 Geo Natural Nature",
      "subtitle": "The Earth Energy Personality\n(Calm presence • steady emotions • comfort-oriented nature)",
      "yourNaturalNature": "This is how your inner world feels, day to day\nBy nature, your inner world feels calm and steady.\nYou move through life at your own pace.\nYou don't feel the need to rush or compete.\nYou value stability — in people, routines, and surroundings.\nOthers often feel relaxed and safe simply being around you.",
      "howYouThinkAndRespond": "This is how you naturally think (refined explanation)\nyou think slowly and thoughtfully.\nFor example, you may agree to something you're not fully comfortable with, avoid saying no, or let an issue go just to prevent arguments or tension.\nIn the moment, this keeps things calm.\nBut your own needs remain unmet.\nBefore acting, you:\n• Observe\n• Feel\n• Reflect\nYou prefer harmony over confrontation.\nIf conflict arises, you may compromise to keep peace — even when it costs you something.",
      "yourSuperpowers": [
        "Emotional depth and compassion",
        "Steadiness — you don't break easily",
        "Consistency and reliability",
        "People trust you because you're grounded and sincere."
      ],
      "whenThisGetsTooMuch": "What quietly drains you\nWhat drains you most is holding emotions inside for too long.\nYou often choose silence over expression to avoid discomfort or disturbance.\nYou tell yourself it's better to let things pass.\nOver time, unexpressed feelings build quietly and weigh on your mind.\nFor example, you may feel hurt or disappointed but choose not to speak up.\nYou tell yourself, \"It's okay, it's not worth it.\"\nBut the feeling doesn't disappear — it stays inside and slowly accumulates.\n\nHow stress shows up in your behavior\nUnder stress, you don't react strongly or immediately.\nInstead, you may:\n• Pull back emotionally\n• Lose motivation\n• Avoid situations that feel demanding\nThis is your way of protecting inner calm when things feel heavy.\nAt first, this helps you avoid immediate conflict and emotional disturbance.\nYou feel calmer on the surface.\nBut over time, this pattern can create inner discomfort.\nYou may feel emotionally tired, unheard, or slightly disconnected — even though nothing openly wrong has happened.\nYour silence keeps peace externally, but creates distance internally.",
      "lifeStageAndSeasonSensitivity": "Cold, damp weather increases sluggishness; emotionally intense periods increase heaviness.",
      "anchors": [
        "Expressing feelings instead of suppressing them",
        "Small steps forward rather than staying still",
        "Encouraging yourself to engage, not retreat"
      ],
      "anchorsTitle": "What helps you feel stable quickly",
      "closingMessage": "One grounding truth about you\nYour calm presence is a gift to others.\nBut it stays healthy when your own needs are also honored.\nStability grows when care flows both ways."
    },
    "P8": {
      "title": "🌧🌬 Geo–Aero Natural Nature",
      "subtitle": "The Earthflow Personality\n(Calm outside • sensitive inside • emotionally responsive nature)",
      "yourNaturalNature": "This is how your inner world feels, day to day\nBy nature, your inner world feels quiet but deeply aware.\nYou notice small things others miss — tone of voice, mood changes, and what is left unsaid.\nBecause of this, your presence feels safe and non-threatening.\nThis often leads to people opening up to you easily.\nThey share their thoughts, worries, or feelings — sometimes without you asking.",
      "howYouThinkAndRespond": "This is how you naturally think\nYou think reflectively and emotionally.\nBefore responding or deciding, you want to understand how you feel about something.\nSudden change feels uncomfortable because it gives you no time to process.\nTo you, Emotional clarity matters more than mere speed.\n\nFor example:\n• You like knowing what to expect before agreeing\n• Sudden changes make you uneasy\n• You feel better when someone explains things calmly\nSpeed matters less to you than emotional comfort.",
      "yourSuperpowers": [
        "Exceptional empathy",
        "Soft, calming presence",
        "Ability to understand others intuitively",
        "People trust you with their feelings."
      ],
      "whenThisGetsTooMuch": "What quietly drains you\nWhat drains you most is absorbing emotions that don't belong to you.\nOften without realizing it, you carry:\n• Other people's worries\n• Their sadness or stress\n• Their expectations\nOver time, this leads to feeling emotionally tired, even when nothing is directly wrong in your own life.\n\nHow stress shows up in your behavior\nWhen stressed, your mind becomes busy while your actions slow down.\nYou may:\n• Overthink small things\n• Delay decisions because things don't feel settled inside\n• Seek comfort in familiarity rather than action\nFor example, you may rewatch old shows, stay in familiar routines, or avoid starting something new until you feel emotionally safe.\nThis is not avoidance — it's your way of coping with emotional overload.",
      "lifeStageAndSeasonSensitivity": "Cold/windy seasons increase anxiety; humid seasons increase lethargy.",
      "anchors": [
        "Expressing feelings in small, honest ways",
        "Creating emotional boundaries",
        "Reminding yourself which emotions are yours — and which are not"
      ],
      "anchorsTitle": "What helps you feel stable quickly",
      "closingMessage": "One grounding truth about you\nYour sensitivity helps you connect deeply with others.\nBut it stays healthy when you don't carry everything you feel.\nCaring deeply doesn't mean carrying it all."
    },
    "P9": {
      "title": "🌧🔥 Geo–Pyro Natural Nature",
      "subtitle": "The Earthfire Personality\n(Steady core • strong values • quiet inner intensity)",
      "yourNaturalNature": "This is how your inner world feels, day to day\nBy nature, your inner world feels steady but intense.\nYou combine care with strength.\nYou don't fluctuate emotionally often, but when something matters, it matters deeply.\nWhen you commit — to people, work, or values — you commit fully.\nHalf-hearted involvement doesn't sit well with you.",
      "howYouThinkAndRespond": "This is how you naturally think\nYou think in terms of clarity, loyalty, and responsibility.\n\nFor example:\n• You prefer honest communication over drama\n• You value trust and consistency\n• You respect people who do what they say\nYou lead quietly — by example, not by force.\nOthers often look to you for stability and fairness.",
      "yourSuperpowers": [
        "Balanced thinking: logic + empathy",
        "Strong follow-through",
        "Deep emotional resilience",
        "People respect you because you mean what you say."
      ],
      "whenThisGetsTooMuch": "What quietly drains you\nWhat drains you most is suppressing irritation to keep peace.\nWhen something feels unfair or disappointing, you often hold it in rather than speak up.\nYou tell yourself it's better to stay composed.\nOver time, this creates emotional buildup inside.\n\nHow stress shows up in your behavior\nUnder stress, you don't explode immediately.\nInstead:\n• You become inwardly tense\n• You stay functional but emotionally tight\n• You continue carrying responsibilities without releasing pressure\nYour mind tries to stay in control by holding everything together, even when it's heavy.",
      "lifeStageAndSeasonSensitivity": "Sticky, humid seasons and long periods of sustained duty increase heaviness; hot, intense phases amplify your inner fire and impatience.",
      "anchors": [
        "Acknowledging irritation early instead of suppressing it",
        "Allowing honest conversations in small doses",
        "Letting yourself pause emotionally, not just continue"
      ],
      "anchorsTitle": "What helps you feel stable quickly",
      "closingMessage": "One grounding truth about you\nYour strength comes from consistency and care.\nBut strength stays healthy when pressure is released, not stored.\nYou don't have to carry everything silently to be strong."
    }
  },
  "vikritiCodeReports": {
    "V0": {
      "title": "V0 — Balanced State",
      "subtitle": "(Minimal imbalance)",
      "whatsHappening": "Your system is in a relatively balanced state with no significant doshic imbalances detected.",
      "whyFeelingLikeThis": "All three doshas are within balanced ranges, indicating good overall health and equilibrium.",
      "commonSymptoms": [
        "No significant symptoms"
      ],
      "earlyWarningsTitle": "Maintain Your Balance",
      "earlyWarnings": "Continue with healthy routines and lifestyle practices to maintain this balanced state.",
      "whatYourBodyNeeds": [
        "Maintain current healthy routines",
        "Regular meals and sleep patterns",
        "Continue balanced lifestyle practices"
      ],
      "closingMessage": "You're well balanced — maintain your current routines."
    },
    "I1": {
      "title": "🌬 Aero Imbalance",
      "subtitle": "\"The Overactive Air Pattern\"\n(When your system is moving too fast right now)",
      "whatsHappening": "Right now, your body and mind are not moving at the same speed.\nYour mind is running fast — like too many tabs open on a computer.\nBut your body is not able to keep up.\nBecause of this:\n• Digestion becomes uneven\n• Energy goes up and down\n• Sleep becomes light or broken\nExample:\nYou feel tired, but your mind doesn't want to switch off.",
      "whyFeelingLikeThis": "This usually happens when daily routine becomes messy.\n\nCommon reasons:\n• Skipping meals or eating at odd times\n• Sleeping late at night\n• Thinking too much or worrying a lot\n• Doing too many things without rest\nExample:\nLike a phone that is used all day without charging — it starts acting strange.\nYour body goes into \"alert mode\", even when there is no danger. This means:\n• Your body behaves as if something bad is about to happen\n• Muscles stay tight\n• Breathing becomes shallow\n• The stomach slows or tightens\n• The mind stays \"on\" all the time\nWhat this leads to:\nBecause your body never relaxes, digestion, sleep, and energy all get disturbed.",
      "commonSymptoms": [
        "Gas or bloating in the stomach",
        "Constipation or irregular motions",
        "Feeling tired suddenly in the middle of the day",
        "Light sleep or difficulty falling asleep",
        "Too many thoughts running in your head",
        "Feeling anxious or restless",
        "Feeling cold or shaky when you don't eat on time",
        "Dry lips or dry skin"
      ],
      "earlyWarningsTitle": "Early warning signs (don't ignore these)",
      "earlyWarnings": "If this continues for long, it can lead to:\n– Regular headaches\n– Feeling tired all the time\n– More anxiety or fear\n– Stomach problems like IBS\n– Difficulty concentrating\n\nExample:\nLike ignoring low fuel warning in a car — the car doesn't stop immediately, but damage starts.",
      "whatYourBodyNeeds": [
        "Eat warm, cooked food",
        "Eat on time — don't skip meals",
        "Reduce mobile, TV, work after sunset",
        "Sit quietly and take slow deep breaths before sleep"
      ],
      "whatNotToDo": [
        "Skip meals",
        "Overwork",
        "Stay awake late",
        "Push yourself when tired"
      ],
      "closingMessage": "This is not your permanent nature.\nThis is just a temporary imbalance.\nWhen routine improves and the body feels safe again, this problem settles faster than you expect."
    },
    "I2": {
      "title": "🔥 Pyro Imbalance",
      "subtitle": "\"The Rising Heat Pattern\"\n(When your system is overheating right now)",
      "whatsHappening": "Right now, your body is producing more heat than it can cool down.\nThink of it like this:\nYour body normally makes heat to digest food, think clearly, and stay active.\nBut right now, that heat is too much and too constant.\nBecause of this excess heat:\n• The stomach lining starts burning → acidity\n• The mind becomes sharp and irritated\n• Small problems feel big\n• The body feels hot and uncomfortable\nReal-life example:\nLike a pressure cooker where the whistle is blocked — steam keeps building inside.\nNothing is wrong with the cooker, but without releasing heat, pressure keeps rising.\nThat's exactly what's happening inside your system right now.",
      "whyFeelingLikeThis": "This usually happens when your life becomes too intense for too long.\nCommon real-life reasons:\n• Working long hours without proper breaks\n• Taking responsibility without rest\n• Sleeping late or sleeping less\n• Eating spicy, oily, or fried food frequently\n• Drinking too much tea, coffee, or energy drinks\n• Constant pressure to perform or prove yourself\nReal-life example:\nImagine driving a car fast for many hours without stopping.\nThe engine doesn't break immediately — but it starts overheating.\nSimilarly, your body has been running on pressure and speed, not balance.\nYour system is stuck in \"overdrive mode\", where it keeps producing heat but doesn't get enough time or support to cool down.",
      "commonSymptoms": [
        "Burning in chest or stomach (acidity)",
        "Loose motions or urgency",
        "Feeling hot, especially at night",
        "Getting irritated or angry quickly",
        "Not tolerating spicy or oily food",
        "Redness in skin or eyes",
        "Headache, especially behind the eyes"
      ],
      "earlyWarningsTitle": "Early warning signs (don't ignore these)",
      "earlyWarnings": "If this heat keeps increasing, it can lead to:\n– Frequent headaches or migraines\n– Stomach lining irritation (gastritis)\n– Hormonal problems linked to heat\n– Mental burnout and frustration\nExample:\nLike ignoring engine overheating — damage starts before the engine stops.",
      "whatYourBodyNeeds": [
        "Eat cooling foods like cucumber, coconut, mint",
        "Reduce spicy, oily food and caffeine",
        "Don't force yourself when tired",
        "Stop screens late at night — they increase inner heat"
      ],
      "whatNotToDo": [
        "Working continuously without breaks",
        "Competing with yourself",
        "Skipping rest to \"finish things\"",
        "Late nights with screens"
      ],
      "closingMessage": "Your fire is a strength, not a problem.\nBut when fire is too high, it needs cooling — not more fuel.\nThis is a temporary imbalance, and it settles quickly when cooled properly."
    },
    "I3": {
      "title": "🌧 Geo Imbalance",
      "subtitle": "\"The Heavy Drift Pattern\"\n(When your system feels slow, heavy, and stuck right now)",
      "whatsHappening": "Right now, your body is moving too slowly.\nThink of your body like a river.\nNormally, water flows smoothly.\nBut right now, the flow has become slow and stagnant.\nBecause of this:\n• Digestion becomes slow\n• Energy feels low\n• The body feels heavy\n• The mind feels dull or unmotivated\nThat's what's happening inside your system right now.",
      "whyFeelingLikeThis": "This usually happens when the body gets too much comfort and too little movement.\nCommon real-life reasons:\n\n• Sitting or lying down for long hours\n• Little or no regular exercise\n• Eating heavy, sugary, or cold foods often\n• Eating when emotionally low or bored\n• Sleeping too much or sleeping at odd times\n• Staying stressed for a long time without action\nReal-life example:\nImagine a phone that is always on charging but never used.\nOver time, it becomes slow and unresponsive.\nSimilarly, your body has gone into storage mode instead of action mode.",
      "commonSymptoms": [
        "Feeling heavy or lazy on waking up",
        "Low motivation or feeling emotionally dull",
        "Digestion feels slow",
        "Feeling full for a long time after meals",
        "Strong cravings for sweets or junk food",
        "Cold, cough, congestion, or mucus",
        "Weight gain or puffiness"
      ],
      "earlyWarningsTitle": "Early warning signs (don't ignore these)",
      "earlyWarnings": "If this state continues for long, it can lead to:\n– Rising blood sugar or pre-diabetes\n– Thyroid slowing\n– Constant tiredness\n– Withdrawing emotionally or socially\nReal-life example:\nLike ignoring water leakage — slow damage happens quietly.",
      "whatYourBodyNeeds": [
        "Gentle movement in the morning, before breakfast",
        "Warm, light food that digests easily",
        "Reduce sugar and cold foods",
        "Spend some time in sunlight during the day"
      ],
      "whatNotToDo": [
        "Oversleeping",
        "Staying inactive all day",
        "Eating out of boredom",
        "Waiting for motivation to come"
      ],
      "closingMessage": "You don't lack discipline.\nYou are not lazy.\nYour body just needs momentum.\nOnce movement starts, energy returns naturally."
    },
    "I4": {
      "title": "🌬🔥 Aero–Pyro Imbalance",
      "subtitle": "\"The Heated Flow Pattern\"\n(When speed and heat rise together right now)",
      "whatsHappening": "Right now, two things are happening at the same time:\n• Your mind is moving too fast\n• Your body is becoming too hot inside\nYour thoughts don't slow down, and your stomach feels irritated.\n\nThis creates a loop like this:\nthinking too much → stomach burning → poor sleep → tired body → even more thinking\nReal-life example:\nLike riding a bike very fast while the engine is overheating — speed keeps increasing, but control is lost.",
      "whyFeelingLikeThis": "This usually happens when life becomes busy and stressful at the same time.\nCommon reasons:\n• Skipping meals because of work or stress\n• Eating irregularly\n• Late nights with work or screens\n• Constant pressure to perform\n• Emotional stress without rest\nReal-life example:\nLike driving a car fast without stopping for fuel or cooling — both speed and heat rise together.\nYour body is trying to run fast, while your system is overheating.",
      "commonSymptoms": [
        "Feeling anxious and irritated together",
        "Gas, bloating, or acidity",
        "Sudden energy drops",
        "Mind running fast at night",
        "Headaches or burning in the stomach",
        "Feeling overwhelmed by small things"
      ],
      "earlyWarningsTitle": "Early warning signs (don't ignore these)",
      "earlyWarnings": "If this continues for long, it may lead to:\n\n– IBS-like stomach problems\n– Panic or sudden fear episodes\n– Migraine headaches\n– Severe sleep disturbance\nReal-life example:\nLike ignoring both low fuel and overheating signs in a car — breakdown becomes more likely.",
      "whatYourBodyNeeds": [
        "Eat warm food on time — do not skip meals",
        "Reduce spicy food and tea/coffee",
        "Slow down your evening routine",
        "Do slow deep breathing for 3–5 minutes before sleep"
      ],
      "whatNotToDo": [
        "Skipping meals",
        "Working late nights",
        "Multitasking constantly",
        "Forcing productivity when tired"
      ],
      "closingMessage": "This is a temporary mixed imbalance, not who you are.\nYour system doesn't need more effort.\nIt needs timing, rest, and cooling.\nWhen rhythm returns, balance follows."
    },
    "I5": {
      "title": "🌬🔥 Pyro–Aero Imbalance",
      "subtitle": "\"The Overheated Wind Pattern\"\n(When heat is high and the mind won't slow down)",
      "whatsHappening": "Right now, your body is too hot and too restless at the same time.\nYour inner fire is burning strong — this creates:\n• Acidity\n• Heat in the body\n• Irritability\nAt the same time, your mind is moving fast, making it hard to relax or sleep.\nReal-life example:\nLike a fan blowing hot air — it keeps moving, but instead of cooling, it makes everything uncomfortable.\nYou are running on intensity, not balance.",
      "whyFeelingLikeThis": "This usually happens when you push yourself too hard for too long.\nCommon reasons:\n• Deadlines and constant pressure\n• Multitasking all day\n• Long screen time\n• Late or irregular meals\n• Trying to \"push through\" tiredness\n• Being hard on yourself\nReal-life example:\nLike revving a bike engine again and again without stopping — heat rises and control reduces.\nYour fire became too strong, and the mind started racing with it.",
      "commonSymptoms": [
        "Acidity along with gas",
        "Hunger that feels urgent and uncomfortable",
        "Feeling irritated without a clear reason",
        "Mind refusing to calm down at night",
        "Light sleep or waking between 2–4 AM",
        "Feeling heat in face, eyes, or chest"
      ],
      "earlyWarningsTitle": "Early warning signs (don't ignore these)",
      "earlyWarnings": "If this pattern continues, it may lead to:\n– Stomach lining irritation (gastritis)\n– Mental and emotional burnout\n– Constant anxiety\n– Hormonal problems related to excess heat\nReal-life example:\nLike ignoring an overheating warning light — damage happens before you realize it.",
      "whatYourBodyNeeds": [
        "Eat cooling foods along with simple, warm meals",
        "Reduce very intense workouts for some time",
        "Keep tea, coffee, and stimulants low",
        "Create one calming habit at night (quiet sitting, breathing, no screen)"
      ],
      "whatNotToDo": [
        "Overworking",
        "Late nights",
        "Skipping meals",
        "Competing with yourself"
      ],
      "closingMessage": "Your fire and speed are strengths.\nBut right now, your body is asking you to cool down, not slow down.\nOnce heat reduces, calm and focus return naturally."
    },
    "I6": {
      "title": "🔥🌧 Pyro–Geo Imbalance",
      "subtitle": "\"The Stagnant Heat Pattern\"\n(When your body feels hot inside but heavy and slow outside)",
      "whatsHappening": "Right now, your body is facing two opposite problems at the same time.\n• Inside, your body is too hot\n• Outside, your body feels heavy and slow\nSo you may feel burning, irritation, or heat,\nbut also laziness, heaviness, or stuck energy.\nReal-life example:\nLike a pan with thick food inside — the bottom gets burnt, but the food doesn't move or cook evenly.\nThat's why you feel both inflamed and stuck.",
      "whyFeelingLikeThis": "This usually happens when heat and heaviness build together.\nCommon real-life reasons:\n• Eating heavy, oily, or sweet food often\n\n• Eating when emotionally stressed\n• Sitting or lying down for long hours\n• Little physical movement\n• Long-term stress without release\nReal-life example:\nLike adding more fuel to a fire that is already burning,\nbut not stirring the pot — heat increases, but flow doesn't.",
      "commonSymptoms": [
        "Burning or acidity after heavy meals",
        "Feeling heavy or dull in the morning",
        "Feeling sleepy in the afternoon",
        "Getting irritated easily",
        "Puffiness in face, hands, or legs",
        "Skin breakouts or feeling hot on skin"
      ],
      "earlyWarningsTitle": "Early warning signs (don't ignore these)",
      "earlyWarnings": "If this continues for long, it may lead to:\n– Blood sugar ups and downs\n– Hormonal imbalance\n– Long-lasting inflammation\n– Weight that becomes hard to reduce\nReal-life example:\nLike water stuck in a pipe — pressure builds, but nothing flows out.",
      "whatYourBodyNeeds": [
        "Eat light, warm food with less oil and spice",
        "Move your body daily (even walking helps)",
        "Avoid eating out of stress or boredom",
        "Drink warm water through the day"
      ],
      "whatNotToDo": [
        "Overeating",
        "Sitting all day",
        "Emotional snacking",
        "Trying extreme diets or forcing workouts"
      ],
      "closingMessage": "You don't need to push harder.\nYour body is not lazy or broken.\nIt just needs release and flow, not more pressure."
    },
    "I7": {
      "title": "🌧🔥 Geo–Pyro Imbalance",
      "subtitle": "\"The Heavy Flame Pattern\"\n(When the body feels heavy, but heat is trapped inside)",
      "whatsHappening": "Right now, your body is holding too much weight and pressure inside.\n• Your body feels heavy, slow, and tired\n• At the same time, heat and irritation are building inside\nSo you may feel:\n• Too tired to act\n• But too irritated to feel calm\nReal-life example:\nLike a thick blanket covering a burning heater — heat gets trapped inside, and nothing feels comfortable.\n\nThat's why you feel stuck and irritated at the same time.",
      "whyFeelingLikeThis": "This usually happens when emotions and stress are held inside for a long time.\nCommon real-life reasons:\n• Worrying quietly without sharing\n• Eating for comfort instead of hunger\n• Staying in stressful situations without change\n• Thinking a lot but not expressing feelings\n• Little physical movement\nReal-life example:\nLike storing trash in a closed room — smell and heat build up slowly.\nYour body starts storing heaviness, while irritation grows underneath.",
      "commonSymptoms": [
        "Feeling very heavy in the morning",
        "Difficulty getting started with the day",
        "Acidity or heartburn after meals",
        "Feeling emotionally \"full\" but unable to express",
        "Craving sweets or cold foods",
        "Puffiness in face, fingers, or stomach",
        "Feeling irritated but avoiding arguments"
      ],
      "earlyWarningsTitle": "Early warning signs (don't ignore these)",
      "earlyWarnings": "If this continues for long, it may lead to:\n– Thyroid slowing\n– Weight that doesn't reduce easily\n– Hormonal imbalance\n– Pulling away emotionally from people\nReal-life example:\nLike water stuck behind a dam — pressure keeps building silently.",
      "whatYourBodyNeeds": [
        "Daily movement to shake off heaviness",
        "Warm, light food instead of cold, heavy meals",
        "Talking about feelings instead of holding them",
        "Reducing late-night eating and scrolling"
      ],
      "whatNotToDo": [
        "Emotional eating",
        "Sitting still for long hours",
        "Keeping everything inside",
        "Forcing yourself without release"
      ],
      "closingMessage": "You are not lazy or weak.\nYour body is simply carrying too much, too quietly.\nLighten the load — and balance will return."
    },
    "I8": {
      "title": "🌬🌧 Aero–Geo Imbalance",
      "subtitle": "\"The Cold–Damp Flow Pattern\"\n(When the mind wants to move but the body feels slow and heavy)",
      "whatsHappening": "Right now, your mind and body are not working together.\n\n• Your mind feels active and restless\n• Your body feels slow, heavy, and stuck\nSo you may want to do things,\nbut your body doesn't feel ready to move.\nReal-life example:\nLike pressing the accelerator while the handbrake is still on — the engine runs, but the car doesn't move properly.\nThis makes you feel frustrated and overwhelmed.",
      "whyFeelingLikeThis": "This usually happens when thinking increases but movement reduces.\nCommon real-life reasons:\n• Sitting for long hours\n• Irregular routine\n• Eating cold or heavy food often\n• Holding emotions inside\n• Overthinking without taking action\nReal-life example:\nLike shaking a snow globe and then letting it settle —\nthe mind stays cloudy while the body becomes heavy.\nYour thoughts speed up, but your body slows down.",
      "commonSymptoms": [
        "Feeling anxious but still procrastinating",
        "Gas along with slow digestion",
        "Sleeping for long hours but waking up tired",
        "Feeling stuck or mentally overloaded",
        "Difficulty starting simple tasks",
        "Craving sweets when stressed"
      ],
      "earlyWarningsTitle": "Early warning signs (don't ignore these)",
      "earlyWarnings": "If this pattern continues, it may lead to:\n– Constant tiredness\n– Emotional ups and downs\n– Weak digestion\n– Pulling away from people or responsibilities\n– Cycles of doing nothing → then sudden burnout\nReal-life example:\nLike a phone that keeps many apps open — battery drains quickly, even without much use.",
      "whatYourBodyNeeds": [
        "Light movement in the morning to wake body and mind",
        "Warm meals at regular times",
        "Daily time with less screen and less noise",
        "Break tasks into small steps — start slowly, but start"
      ],
      "whatNotToDo": [
        "Waiting for motivation to come",
        "Sitting still all day",
        "Multitasking without finishing",
        "Overthinking without action"
      ],
      "closingMessage": "You are not lazy.\nYou are not incapable.\nYour mind wants motion, and your body needs rhythm.\n\nMeet them halfway — and balance will return."
    },
    "I9": {
      "title": "🌧🌬 Geo–Aero Imbalance",
      "subtitle": "\"The Heavy Air Pattern\"\n(When the body feels heavy and the mind carries quiet worry)",
      "whatsHappening": "Right now, your body is slowing down, but your mind is not fully calm.\n• Your body feels heavy, tired, and slow\n• Your mind holds quiet worries and tension\nFrom the outside, you may look calm.\nInside, you feel unsettled, overloaded, or emotionally full.\nReal-life example:\nLike sitting in a still room with a fan switched on inside your head — nothing moves outside,\nbut inside there is noise.\nThis creates:\nlow energy + low motivation + silent stress",
      "whyFeelingLikeThis": "This usually happens when feelings are held in and movement is low.\nCommon real-life reasons:\n• Keeping emotions to yourself\n• Carrying responsibilities without sharing\n• Sitting or resting too much\n• Oversleeping or irregular routines\n• Eating for comfort instead of hunger\n• Worrying quietly without action\nReal-life example:\nLike a bag that keeps getting filled but is never emptied — it becomes heavy to carry.\nYour body stores heaviness, and your mind carries worry.",
      "commonSymptoms": [
        "Heavy, slow mornings",
        "Feeling tired most of the day",
        "Thinking a lot but not acting",
        "Feeling lonely or disconnected",
        "Puffiness in face, hands, or legs",
        "Emotional or comfort eating"
      ],
      "earlyWarningsTitle": "Early warning signs (don't ignore these)",
      "earlyWarnings": "If this continues for long, it may lead to:\n– Gradual weight gain\n– Emotional dullness or numbness\n– Lower energy and motivation\n– Anxiety episodes\n– Sleep problems\nReal-life example:\nLike fog slowly covering a road — visibility reduces step by step.",
      "whatYourBodyNeeds": [
        "Gentle movement and sunlight in the morning",
        "Warm, light food instead of emotional snacking",
        "Avoid long daytime naps",
        "Share your thoughts with someone you trust"
      ],
      "whatNotToDo": [
        "Keeping everything inside",
        "Staying inactive all day",
        "Eating only for comfort",
        "Isolating yourself emotionally"
      ],
      "closingMessage": "You are not weak.\nYou are not lazy.\nYou've just been carrying too much alone.\nLet warmth, movement, and connection help you release it."
    }
  }
}
