{
  "body": {
    "Ectomorph": {
      "paragraph": "You are naturally light, quick, sensitive, and mentally active. Your body responds fast to change, and so does your mind. You may find it hard to gain weight, and energy may fluctuate.",
      "commonFeeling": "Sometimes my mind is ahead of my body.",
      "tip": "Eat warm, cooked foods and keep a steady meal routine."
    },
    "Mesomorph": {
      "paragraph": "You are naturally strong, athletic, and focused. Your digestion is usually good, and your body responds well to routines. You have an inner fire and drive that makes you disciplined.",
      "commonFeeling": "My energy is strong but sometimes overheats.",
      "tip": "Keep meals non-spicy and avoid skipping meals."
    },
    "Endomorph": {
      "paragraph": "You are naturally grounded, steady, supportive, and emotionally warm. Your body holds energy well, but sometimes this turns into heaviness.",
      "commonFeeling": "I start slow but remain steady.",
      "tip": "Start your morning with movement before eating."
    }
  },
  "modifiers": {
    "Ectomorph": {
      "Pitta": "You feel light but also driven, sharp, and intense.",
      "Kapha": "You feel light but sometimes get tired easily or feel low energy."
    },
    "Mesomorph": {
      "Vata": "You feel strong but also get restless or overstimulated.",
      "Kapha": "You feel strong but also experience heaviness or cravings at times."
    },
    "Endomorph": {
      "Vata": "Heaviness with restlessness or anxiety.",
      "Pitta": "Heaviness with internal heat, irritation, or acidity."
    }
  },
  "prakriti": {
    "Vata": {
      "paragraph": "You are creative, intuitive, imaginative, fast-thinking, and emotionally sensitive. You notice things others miss.",
      "strengths": [
        "Quick learner",
        "Creative mind",
        "Empathetic"
      ],
      "tip": "Warmth + routine stabilizes you."
    },
    "Pitta": {
      "paragraph": "You are driven, focused, practical, disciplined, and passionate. You like clarity and purpose.",
      "strengths": [
        "Leadership",
        "Determination",
        "Problem-solving"
      ],
      "tip": "Cooling foods calm your inner fire."
    },
    "Kapha": {
      "paragraph": "You are nurturing, patient, loyal, kind, and emotionally deep. People trust you quickly.",
      "strengths": [
        "Stability",
        "Compassion",
        "Endurance"
      ],
      "tip": "Movement + warmth keeps you energized."
    }
  },
  "prakritiModifiers": {
    "Vata": {
      "Pitta": "Creative + sharp — beautiful combination but needs cooling.",
      "Kapha": "Creative + steady — needs stimulation to avoid stagnation."
    },
    "Pitta": {
      "Vata": "Driven + restless — powerful but needs grounding.",
      "Kapha": "Driven + steady — powerhouse but needs lightness."
    },
    "Kapha": {
      "Vata": "Nurturing + sensitive — needs grounding.",
      "Pitta": "Nurturing + strong — needs cooling."
    }
  },
  "vikriti": {
    "Vata": {
      "paragraph": "You may feel restless, anxious, overwhelmed, or mentally overactive. Your body may feel cold, sensitive, or irregular.",
      "quickTip": "Warm foods + early dinners + grounding breathwork.",
      "empathyLine": "Your system feels restless and needs grounding."
    },
    "Pitta": {
      "paragraph": "You may feel irritated, heated, acidic, impatient, or mentally overdriven.",
      "quickTip": "Cool down your system — avoid spicy food for 48 hours.",
      "empathyLine": "Your system is heated — cool and calm routines will help."
    },
    "Kapha": {
      "paragraph": "You may feel heavy, dull, emotionally low, or low on energy.",
      "quickTip": "Warm water + movement first thing in morning.",
      "empathyLine": "Your system feels heavy — warmth, movement and light foods will help."
    },
    "Vata-Pitta": {
      "paragraph": "You may feel restless + irritated together — tired but unable to relax.",
      "quickTip": "Warm, soft meals; no spicy foods for the next 48 hours.",
      "empathyLine": "Restless and heated — ground + cool."
    },
    "Pitta-Vata": {
      "paragraph": "You may feel overwhelmed + overheated — anxious but triggered easily.",
      "quickTip": "Cool the body; slow the mind.",
      "empathyLine": "Heated and restless — cool + ground."
    },
    "Pitta-Kapha": {
      "paragraph": "Heat trapped under heaviness — frustration mixing with emotional weight.",
      "quickTip": "Light dinners + avoid spicy food.",
      "empathyLine": "Heated and heavy — cool + move."
    },
    "Kapha-Pitta": {
      "paragraph": "Feeling stuck but irritated; heavy inside and hot inside.",
      "quickTip": "Warm morning routine + light meals.",
      "empathyLine": "Heavy and heated — move + cool."
    },
    "Vata-Kapha": {
      "paragraph": "Restless mind + heavy body — wanting to move but unable to start.",
      "quickTip": "Warm water + 20 min walk today.",
      "empathyLine": "Restless yet heavy — ground + move."
    },
    "Kapha-Vata": {
      "paragraph": "Heavy body + anxious mind — emotional weight plus mental restlessness.",
      "quickTip": "Warm, light meals + grounding breath.",
      "empathyLine": "Heavy yet restless — move + ground."
    },
    "Balanced": {
      "paragraph": "Your current Vikriti shows a balanced state, with all three doshas working in harmony. This indicates good overall health and balance in your system. Continue maintaining your current routines, diet, and lifestyle practices that support this equilibrium.",
      "quickTip": "Maintain your current balanced routines and lifestyle practices.",
      "empathyLine": "You're well balanced — maintain your current routines."
    }
  },
  "paidPreview": {
    "text": "To help you heal deeply, I've created a personalized 14-day plan that includes: Food plan • Movement plan • Sleep guidance • Emotional healing ritual • 24-hour quick fix • Herb suggestions • What your body is REALLY trying to tell you",
    "features": [
      "Food plan",
      "Movement plan",
      "Sleep guidance",
      "Emotional healing ritual",
      "24-hour quick fix",
      "Herb suggestions",
      "What your body is REALLY trying to tell you"
    ]
  },
  "bodyCodeReports": {
    "B1": {
      "title": "🌬 Aero Energy Body: \"The Lightflow Build\"",
      "subtitle": "(Pure Aero — light frame, fast mind, sensitive digestion)",
      "howYourBodyLives": "You have a naturally light frame — you may feel the cold more than others and tire faster when routines change. Hunger isn't consistent: some days you forget to eat… other days you suddenly realize you're starving. Gas and bloating come when meals are skipped or rushed.",
      "howYourMindMoves": "Ideas come faster than you can execute them. Your excitement to begin is high… but energy doesn't always stay to finish. You take in a lot — sounds, emotions, people's moods — and it drains you quietly.",
      "howStressShowsUp": "You don't always talk about your stress — but your body does: a tight stomach, racing thoughts at night, sudden exhaustion in the day.",
      "earlySignals": [
        "Cold hands + feet",
        "Dry skin/lips",
        "Light, broken sleep",
        "Energy that crashes suddenly",
        "Feeling better after warm food"
      ],
      "dailyAnchors": [
        "Warm food → regular digestion",
        "Predictable meal + sleep times → calmer mind",
        "Gentle, grounding movement → steady energy"
      ],
      "closingMessage": "Your body doesn't need more speed — it needs more stability."
    },
    "B2": {
      "title": "🌬🔥 Aero–Pyro Energy Body: \"The Lightfire Build\"",
      "subtitle": "(Aero body with Pyro influence — fast system, heat under stress)",
      "howYourBodyLives": "You have a naturally slim build but sharp features — your body responds fast. When life is structured, digestion is strong. But when hunger is delayed or stress rises → acidity, headache or bloating appear.",
      "howYourMindMoves": "You want things done properly and quickly. You take on responsibility even when your plate is full. You don't like being slowed down, and you don't let yourself rest easily.",
      "howStressShowsUp": "You push through tiredness… until irritation comes out suddenly. Your mind gets hot before your body does — and then both feel inflamed.",
      "earlySignals": [
        "Urgent hunger",
        "Burning sensation in chest/stomach",
        "Light sleep when stressed",
        "Getting \"hangry\"",
        "Quick digestion → then discomfort"
      ],
      "dailyAnchors": [
        "Eat before hunger turns sharp",
        "Prefer warm foods but avoid chilli heat",
        "Slow evenings: soft lights, softer conversations"
      ],
      "closingMessage": "Cooling the mind + grounding the body = your best health."
    },
    "B3": {
      "title": "🌬🌧 Aero–Geo Energy Body: \"The Lightearth Build\"",
      "subtitle": "(Aero body with Geo grounding — light outside, heavy inside)",
      "howYourBodyLives": "Though your frame is light, your body can hold on to weight — especially around belly/hips — when routine slows. Your digestion prefers warmth and consistent timings.",
      "howYourMindMoves": "You appear calm… but inside your thoughts move constantly. You often wait for the \"right energy\" to start something — not laziness, just needing emotional readiness.",
      "howStressShowsUp": "You withdraw to protect yourself. Food becomes a comfort when life feels heavy. Body slows down; mind keeps spinning. Sleep might be long but not refreshing.",
      "earlySignals": [
        "Heavy mornings",
        "Feeling full for too long",
        "Gas + sluggish digestion",
        "Sweet cravings during overwhelm",
        "Restless mind at bedtime"
      ],
      "dailyAnchors": [
        "Move before breakfast to wake digestion",
        "Smaller dinner, warmer day meals",
        "Warm water every 2–3 hours"
      ],
      "closingMessage": "Your body asks for steady movement; your mind asks for gentleness."
    },
    "B4": {
      "title": "🔥 Pyro Energy Body: \"The Fireform Build\"",
      "subtitle": "(Pure Pyro — strong build, sharp digestion, heat-sensitive)",
      "howYourBodyLives": "You are built with strength — good muscle tone, clear skin, sharp features. Hunger arrives on time and asks to be respected. When routine slips or meals delay, acidity or heat builds quickly.",
      "howYourMindWorks": "You thrive on clarity, purpose, and results. When others are confused, you bring direction. You take ownership naturally — sometimes more than necessary.",
      "howStressShowsUp": "Stress first shows as irritability or internal heat. You don't like inefficiency or unfairness — your mind burns to fix things. Digestive discomfort, headaches, or flushing appear under pressure.",
      "earlySignals": [
        "Acidity / burning sensation",
        "Sensitive skin or rashes",
        "Body heat at night",
        "Sudden bursts of anger",
        "Hunger that feels urgent"
      ],
      "dailyAnchors": [
        "Cooling foods: cucumber, coconut, mint",
        "Avoid skipping meals (top trigger for you)",
        "Quiet evening routine to cool the mind + digestion"
      ],
      "closingMessage": "Your strength is fire — protect it from turning into inflammation."
    },
    "B5": {
      "title": "🔥🌬 Pyro–Aero Energy Body: \"The Fireflow Build\"",
      "subtitle": "(Pyro body with Aero mind — strong body, fast mind, burnout-prone)",
      "howYourBodyLives": "Athletic frame with active energy. Digestion is strong when calm, but anxiety or rushing causes acidity, gas, or sudden appetite loss.",
      "howYourMindWorks": "You're a problem-solver with quick decisions. You think fast, move fast, and expect life to keep up. You push yourself — even when tired — because you want to finish things perfectly.",
      "howStressShowsUp": "You don't slow down… until your system forces you to. Sleep gets lighter, energy drops suddenly, and frustration rises. Your nervous system and gut feel every deadline.",
      "earlySignals": [
        "Tight throat during stress",
        "Heartburn + bloating combo",
        "Waking up at 2–3 AM",
        "Mood goes from calm → explosive",
        "Sugar/tea/coffee to keep going"
      ],
      "dailyAnchors": [
        "Slow meals — chew properly",
        "Set a \"no work after this time\" rule",
        "Avoid intense workouts late evening"
      ],
      "closingMessage": "Ambition drives you far — grounding will help you sustain the journey."
    },
    "B6": {
      "title": "🔥🌧 Pyro–Geo Energy Body: \"The Fireearth Build\"",
      "subtitle": "(Pyro body with Geo stabilizing — strength + heaviness cycle)",
      "howYourBodyLives": "Your body holds strength and stamina. Hunger is strong — sometimes emotional. If meals become heavy or late, digestion slows and acidity or heaviness arrives together.",
      "howYourMindWorks": "You are calm until pushed — then fierce. You care deeply about people and quality. You protect others, even when you need protection yourself.",
      "howStressShowsUp": "You suppress irritation to stay composed — it later appears as heartburn, headaches, overthinking, or comfort eating. Heat + heaviness increases in cycles.",
      "earlySignals": [
        "Puffy face or fingers in the morning",
        "Acidity after oily/spicy meals",
        "Sluggish start to day",
        "Feeling stuck mentally when overwhelmed",
        "Desire for sweets during emotional load"
      ],
      "dailyAnchors": [
        "Warm but non-spicy meals",
        "20–30 mins morning movement to lift heaviness",
        "Dinner light + early to reduce night heat"
      ],
      "closingMessage": "Your steadiness is powerful — lighten the load so your fire remains a strength."
    },
    "B7": {
      "title": "🌧 Geo Energy Body: \"The Earthform Build\"",
      "subtitle": "(Pure Geo — grounded, steady, slow metabolism)",
      "howYourBodyLives": "Your body is naturally strong and stable. You gain weight easily — not because you overeat, but because your system stores energy efficiently. Digestion is slow but steady, and you take time to wake up fully in the morning.",
      "howYourMindWorks": "You are calming to be around. You don't hurry decisions — you think, feel, consider. You enjoy routine and lasting bonds. Change feels uncomfortable until you trust it.",
      "howStressShowsUp": "You internalize first, withdraw later. Stress slows your motivation, and emotions may show as heaviness in the body. Comfort foods become emotional protection.",
      "earlySignals": [
        "Hard-to-get-up mornings",
        "Puffiness or water retention",
        "Long-lasting fullness after meals",
        "Feeling sleepy after eating",
        "Congestion or mucus increase"
      ],
      "dailyAnchors": [
        "Move before breakfast to wake metabolism",
        "Warm, lightly spiced foods help digestion",
        "Avoid long daytime naps"
      ],
      "closingMessage": "Your steadiness is your strength — just help your energy stay in motion."
    },
    "B8": {
      "title": "🌧🌬 Geo–Aero Energy Body: \"The Earthflow Build\"",
      "subtitle": "(Geo body with Aero mind — heavy body, sensitive mind)",
      "howYourBodyLives": "Your frame is strong, but energy is inconsistent — some days active, some days heavy. Digestion slows when life gets unpredictable, and bloating or discomfort appears after cold or irregular meals.",
      "howYourMindWorks": "You appear calm and patient, but your mind absorbs a lot. You replay conversations, worry about misunderstandings, and sometimes delay important decisions because emotions feel unclear.",
      "howStressShowsUp": "When stressed, the mind speeds up while the body slows down. Sleep may be long but not restful. Emotional eating becomes tempting when thoughts get overwhelming.",
      "earlySignals": [
        "Heavy but restless nights",
        "Gas + sluggish digestion",
        "Sweet cravings for comfort",
        "Feeling \"stuck but worried\"",
        "Overthinking before sleeping"
      ],
      "dailyAnchors": [
        "Gentle morning exercise (even 15 min walk)",
        "Warm meals on a steady timing",
        "Reduce screens 30–45 mins before sleep"
      ],
      "closingMessage": "Your body needs motion; your mind needs reassurance. Give both gently."
    },
    "B9": {
      "title": "🌧🔥 Geo–Pyro Energy Body: \"The Earthfire Build\"",
      "subtitle": "(Geo body with Pyro heat — strong, warm, emotional storage pattern)",
      "howYourBodyLives": "Your body has strength and a reliable appetite. You digest well when calm — but stress or heavy meals create both heat and sluggishness. Weight tends to stick, especially with emotional phases.",
      "howYourMindWorks": "You are calm on the outside but passionate inside. You care deeply and take responsibility seriously. You want stability, but you also want respect and progress.",
      "howStressShowsUp": "You absorb pressure quietly until irritation leaks through. Anger may feel delayed but intense. Body responds with heartburn, headaches, or heavy fatigue.",
      "earlySignals": [
        "Heaviness + heat after meals",
        "Puffy face/fingers in morning",
        "Afternoon slump",
        "Emotional cravings (especially sweets)",
        "Staying silent even when hurt"
      ],
      "dailyAnchors": [
        "Warm but non-spicy meals",
        "20–25 min activity daily — morning best",
        "Eat until satisfied, not full"
      ],
      "closingMessage": "You hold a lot inside — let movement and lighter routines carry what your body shouldn't store."
    }
  },
  "prakritiCodeReports": {
    "P1": {
      "title": "🌬 Aero Nature: \"The Light Energy Personality\"",
      "subtitle": "(Pure Aero mind–body nature)",
      "yourNaturalNature": "Your mind is always traveling — towards ideas, plans, stories, possibilities. You feel the world strongly: sounds, emotions, mood shifts… all affect you immediately.",
      "howYouThinkAndRespond": "You're curious and imaginative. Routine feels restricting — you thrive in flexibility. You start fast because inspiration pulls you forward… finishing happens when energy supports you.",
      "yourSuperpowers": [
        "Creative problem-solving",
        "Adaptability — you adjust faster than most",
        "Empathy — you \"catch\" emotions quickly",
        "People come to you for ideas and genuine connection."
      ],
      "whenThisGetsTooMuch": "If life becomes unstable, your \"creative mind\" turns into a swirling storm — overthinking, anxiety, restlessness, scattered focus.",
      "lifeStageAndSeasonSensitivity": "Late nights, winters, and major life transitions amplify Aero-nature — you feel more anxious, cold, and mentally drained.",
      "anchors": [
        "Predictable routines around food & sleep",
        "One idea at a time → completion first",
        "Slow breathing before bed → calmer sleep"
      ],
      "anchorsTitle": "3 Stability Anchors",
      "closingMessage": "Your imagination is your gift — protect the peace it needs to shine."
    },
    "P2": {
      "title": "🌬🔥 Aero–Pyro Nature: \"The Lightfire Personality\"",
      "subtitle": "(Fast mind + sharp focus personality)",
      "yourNaturalNature": "You're a mix of speed and fire — quick to think, quick to decide. You enjoy challenges and set high standards for yourself.",
      "howYouThinkAndRespond": "Once you get an idea, you want to execute it immediately. You speak the truth openly — sometimes faster than the other person can receive it.",
      "yourSuperpowers": [
        "Leadership + creativity together",
        "High ambition with sharp focus",
        "Ability to inspire and push others forward",
        "People rely on your drive — you make things happen."
      ],
      "whenThisGetsTooMuch": "Your ambition doesn't always wait for your energy. Anxiety + irritability show up when you're doing too much, too fast. You may push through burnout until the body protests.",
      "lifeStageAndSeasonSensitivity": "Hot weather and high-pressure phases increase heat + restlessness → short temper / sleeplessness.",
      "anchors": [
        "Pause before reacting — allow feelings to settle",
        "Cooling foods + calming evening routines",
        "Schedule recovery like you schedule success"
      ],
      "anchorsTitle": "3 Balancing Anchors",
      "closingMessage": "Your fire builds futures — just don't let it scorch your peace."
    },
    "P3": {
      "title": "🌬🌧 Aero–Geo Nature: \"The Lightearth Personality\"",
      "subtitle": "(Sensitive mind + stable emotional core)",
      "yourNaturalNature": "You connect with people deeply. You notice what others feel before they say a word. You think long and soft — processing through feelings.",
      "howYouThinkAndRespond": "You are careful with decisions. You move when it feels right — not when rushed. You love comfort, familiarity, and secure bonds.",
      "yourSuperpowers": [
        "Emotional intelligence",
        "Loyalty and reliability",
        "Calm presence in hectic situations",
        "People trust you because you genuinely care."
      ],
      "whenThisGetsTooMuch": "If emotions pile up or stress feels constant, you may withdraw quietly, procrastinate important things, and seek comfort in food or sleep.",
      "lifeStageAndSeasonSensitivity": "Cold/damp seasons and emotional upheavals increase heaviness in body + worry in mind.",
      "anchors": [
        "Morning movement to lift mood + energy",
        "Express what you feel instead of holding it",
        "Smaller treats; more comforting routines"
      ],
      "anchorsTitle": "3 Heart-Calming Anchors",
      "closingMessage": "Your care is powerful — give some of it back to yourself."
    },
    "P4": {
      "title": "🔥 Pyro Nature: \"The Fire Energy Personality\"",
      "subtitle": "(Pure focused, driven, purposeful personality)",
      "yourNaturalNature": "You function best where there is clarity and purpose. You dislike chaos, half-truths, and guesswork. When you decide something, you give it your full energy.",
      "howYouThinkAndRespond": "You observe situations logically and cut straight to the point. You don't sugarcoat — not because you're harsh, but because honesty matters more to you than comfort.",
      "yourSuperpowers": [
        "Strong memory and sharp decision-making",
        "Leadership that makes others feel secure",
        "Courage to stand for what's right",
        "People trust you to get things done correctly."
      ],
      "whenThisGetsTooMuch": "Your passion can turn into impatience. When others move slower, frustration rises. Stress creates internal heat → headaches, acidity, irritability.",
      "lifeStageAndSeasonSensitivity": "Summer and peak career phases increase intensity — passion can overpower balance.",
      "anchors": [
        "Cooling activities: moonlight walks, calming music",
        "Eat before hunger becomes urgent",
        "Appreciate small progress — not only perfection"
      ],
      "anchorsTitle": "3 Balance Anchors",
      "closingMessage": "Your clarity changes lives — let gentleness protect your fire."
    },
    "P5": {
      "title": "🔥🌬 Pyro–Aero Nature: \"The Fireflow Personality\"",
      "subtitle": "(Driven but fast-thinking, burnout-prone personality)",
      "yourNaturalNature": "You see possibilities and chase them quickly. You enjoy a busy schedule — it makes you feel alive and useful.",
      "howYouThinkAndRespond": "You multitask effortlessly, but at the cost of inner calm. You act as soon as ideas arrive — delaying feels suffocating.",
      "yourSuperpowers": [
        "Execution with creativity",
        "Can lead under pressure",
        "Quick learner, bold decision-maker",
        "People look to you when urgency matters."
      ],
      "whenThisGetsTooMuch": "You override your own energy alarms. Anxious thoughts and sleep disturbance creep in. Hunger signals get ignored → leading to acidity or sudden crashes.",
      "lifeStageAndSeasonSensitivity": "Hot weather + overwork = irritability + internal heat + nervous tension.",
      "anchors": [
        "Prioritize recovery as much as productivity",
        "Soften competition — especially with yourself",
        "Warm food, cooled mind — daily ritual"
      ],
      "anchorsTitle": "3 Balance Anchors",
      "closingMessage": "Your speed is a gift — but rest is what keeps you unstoppable."
    },
    "P6": {
      "title": "🔥🌧 Pyro–Geo Nature: \"The Fireearth Personality\"",
      "subtitle": "(Strong-willed yet emotionally deep personality)",
      "yourNaturalNature": "You take responsibility seriously — almost personally. You can balance logic and empathy beautifully. You protect people and ideas you value.",
      "howYouThinkAndRespond": "Once you commit, you stay. You dislike giving up — even when tired or hurt. You don't show weakness easily, even to yourself.",
      "yourSuperpowers": [
        "Consistency + willpower = solid results",
        "Emotional loyalty — relationships bloom with you",
        "Quiet leadership that others trust deeply",
        "People feel safe in your strength."
      ],
      "whenThisGetsTooMuch": "Stress gets swallowed, not shared. Frustration builds slowly → turns into heaviness, irritation, emotional eating, or withdrawal.",
      "lifeStageAndSeasonSensitivity": "Humidity and long stressful phases increase heaviness in body + heat in mind.",
      "anchors": [
        "Move emotions out — talk, write, walk",
        "Light dinners + morning movement",
        "Celebrate yourself as much as you support others"
      ],
      "anchorsTitle": "3 Balance Anchors",
      "closingMessage": "You carry others so well — remember, you deserve the same support."
    },
    "P7": {
      "title": "🌧 Geo Nature: \"The Earth Energy Personality\"",
      "subtitle": "(Pure grounded, calm, steady personality)",
      "yourNaturalNature": "You move through life with warmth and patience. You value stability — in relationships, routines, and environments. People often find comfort just being around you.",
      "howYouThinkAndRespond": "You don't rush decisions. You observe, feel, absorb… and only act when your heart agrees. You dislike conflict and prefer harmony — even if it means compromising occasionally.",
      "yourSuperpowers": [
        "Emotional depth and compassion",
        "Steadiness — you don't break easily",
        "Consistency and reliability",
        "People trust you because you're grounded and sincere."
      ],
      "whenThisGetsTooMuch": "If emotions build up unexpressed, they turn into heaviness — in the body and in thoughts. Motivation dips, cravings rise, and you may withdraw quietly.",
      "lifeStageAndSeasonSensitivity": "Cold, damp weather increases sluggishness; emotionally intense periods increase heaviness.",
      "anchors": [
        "Daily morning movement — even 15 mins",
        "Light, warm meals to energize metabolism",
        "Emotional expression — not suppression"
      ],
      "anchorsTitle": "3 Balance Anchors",
      "closingMessage": "Your presence heals others — keep yourself light enough to shine."
    },
    "P8": {
      "title": "🌧🌬 Geo–Aero Nature: \"The Earthflow Personality\"",
      "subtitle": "(Calm outside, sensitive inside personality)",
      "yourNaturalNature": "You feel deeply and notice subtleties others miss. You have a quiet wisdom — and people often open up to you without asking.",
      "howYouThinkAndRespond": "You reflect before reacting. You want emotional clarity before making decisions. Sudden change feels uncomfortable; emotional safety matters more than speed.",
      "yourSuperpowers": [
        "Exceptional empathy",
        "Soft, calming presence",
        "Ability to understand others intuitively",
        "People trust you with their feelings."
      ],
      "whenThisGetsTooMuch": "You absorb too much — others' moods, words, expectations. This creates inner restlessness with outer heaviness. You may overthink, procrastinate, or use food for comfort.",
      "lifeStageAndSeasonSensitivity": "Cold/windy seasons increase anxiety; humid seasons increase lethargy.",
      "anchors": [
        "Warm routines: meals, showers, tea",
        "Express feelings in small, honest ways",
        "Use gentle movement to release emotional weight"
      ],
      "anchorsTitle": "3 Balance Anchors",
      "closingMessage": "You carry feelings beautifully — just don't carry what isn't yours."
    },
    "P9": {
      "title": "🌧🔥 Geo–Pyro Nature: \"The Earthfire Personality\"",
      "subtitle": "(Stable base + inner intensity personality)",
      "yourNaturalNature": "You combine strength with compassion. You are dependable — when you commit, you commit with your full heart and full discipline.",
      "howYouThinkAndRespond": "You prefer clarity and loyalty. You dislike drama and untrustworthy behavior. You lead by example — steady, patient, and protective.",
      "yourSuperpowers": [
        "Balanced thinking: logic + empathy",
        "Strong follow-through",
        "Deep emotional resilience",
        "People respect you because you mean what you say."
      ],
      "whenThisGetsTooMuch": "You may suppress irritation to avoid conflict. This leads to internal heat, emotional buildup. Over time this turns into internal heat (Pitta) plus physical heaviness or stagnation (Kapha) — so you can feel both inflamed and weighed down.",
      "lifeStageAndSeasonSensitivity": "Sticky, humid seasons and long periods of sustained duty increase heaviness; hot, intense phases amplify your inner fire and impatience.",
      "anchors": [
        "Start the day with 20–25 min movement — it lifts both mood and metabolism",
        "Keep dinners lighter and earlier to reduce night heat and heaviness",
        "Make a short daily check-in (2 minutes) to notice small irritations before they grow"
      ],
      "anchorsTitle": "3 Practical Anchors to Stay Well",
      "closingMessage": "A gentle reminder: your steadiness heals others — let small daily choices restore you too."
    }
  },
  "vikritiCodeReports": {
    "V0": {
      "title": "V0 — Balanced State",
      "subtitle": "(Minimal imbalance)",
      "whatsHappening": "Your system is in a relatively balanced state with no significant doshic imbalances detected.",
      "whyFeelingLikeThis": "All three doshas are within balanced ranges, indicating good overall health and equilibrium.",
      "commonSymptoms": [
        "No significant symptoms"
      ],
      "earlyWarningsTitle": "Maintain Your Balance",
      "earlyWarnings": "Continue with healthy routines and lifestyle practices to maintain this balanced state.",
      "whatYourBodyNeeds": [
        "Maintain current healthy routines",
        "Regular meals and sleep patterns",
        "Continue balanced lifestyle practices"
      ],
      "closingMessage": "You're well balanced — maintain your current routines."
    },
    "V1": {
      "title": "🌬 Aero Imbalance: \"The Overactive Air Pattern\"",
      "subtitle": "(Excess lightness, anxiety, gas, restlessness)",
      "whatsHappening": "Your nervous system is overstimulated. Your thoughts are moving faster than your body can stabilize. This creates irregular digestion, energy fluctuations, and disturbed sleep.",
      "whyFeelingLikeThis": "Stress, irregular meals, late nights, or emotional overload have pushed Vata higher than your system can handle. Your body is in \"alert mode,\" even when nothing dangerous is happening.",
      "commonSymptoms": [
        "Gas, bloating, constipation",
        "Sudden energy dips",
        "Light, broken sleep or difficulty falling asleep",
        "Racing thoughts, anxiety, overthinking",
        "Feeling cold or shaky when hungry",
        "Dry skin or lips"
      ],
      "earlyWarningsTitle": "Early Warnings You Should Pay Attention To",
      "earlyWarnings": "If Vata stays high, it can trigger: frequent headaches, chronic fatigue, worsening anxiety, IBS-like symptoms.",
      "whatYourBodyNeeds": [
        "Warm, cooked meals at regular times",
        "Reduce stimulation after sunset",
        "Slow breathing before sleep",
        "Avoid skipping meals — biggest trigger for you"
      ],
      "closingMessage": "Your system is asking for grounding — not speed."
    },
    "V2": {
      "title": "🔥 Pyro Imbalance: \"The Rising Heat Pattern\"",
      "subtitle": "(Acidity, irritation, sharpness, inflammation)",
      "whatsHappening": "Your inner heat is rising faster than your body can cool it. This creates inflammation, acidity, and irritability. Your digestive fire is strong — but easily triggered.",
      "whyFeelingLikeThis": "Stress, long working hours, poor sleep, spicy/oily food, or pushing yourself too hard have aggravated Pitta. You're running on intensity — not balance.",
      "commonSymptoms": [
        "Acidity, burning, loose motions",
        "Body heat rising at night",
        "Irritability, quick anger",
        "Sensitivity to spicy/oily foods",
        "Redness in skin or eyes",
        "Headache behind the eyes"
      ],
      "earlyWarningsTitle": "Early Warnings You Should Not Ignore",
      "earlyWarnings": "Increasing Pitta can lead to: migraines, gastritis, hormonal heat issues, burnout.",
      "whatYourBodyNeeds": [
        "Cooling foods (coconut, cucumber, mint)",
        "Reduce caffeine & spicy food",
        "Avoid pushing through fatigue",
        "Stop late-night screens — they spike heat"
      ],
      "closingMessage": "Your fire is powerful — cool it before it burns your calm."
    },
    "V3": {
      "title": "🌧 Geo Imbalance: \"The Heavy Drift Pattern\"",
      "subtitle": "(Sluggish digestion, low mood, heaviness)",
      "whatsHappening": "Your body is moving slower than your mind. Digestion is sluggish, the lymphatic system is congested, and emotional weight is turning into physical heaviness.",
      "whyFeelingLikeThis": "Irregular routines, emotional eating, low activity, cold foods, poor sleep, or prolonged stress have elevated Kapha.",
      "commonSymptoms": [
        "Feeling heavy on waking",
        "Low motivation or emotional dullness",
        "Slow digestion, feeling full for long",
        "Sugar cravings",
        "Congestion or mucus",
        "Weight gain or swelling"
      ],
      "earlyWarningsTitle": "Early Warnings to Watch Out For",
      "earlyWarnings": "Unmanaged Kapha can lead to: pre-diabetes, thyroid slowing, chronic fatigue, emotional withdrawal.",
      "whatYourBodyNeeds": [
        "Morning movement (before breakfast)",
        "Warm, light meals",
        "Reduce sugar + cold foods",
        "Increase daylight exposure"
      ],
      "closingMessage": "You don't lack discipline — your body just needs momentum."
    },
    "V4": {
      "title": "🌬🔥 Aero–Pyro Imbalance: \"The Heated Flow Pattern\"",
      "subtitle": "(Aero dominant — nervous + heat combination)",
      "whatsHappening": "Your nervous system is overstimulated (Vata high), and your digestive fire is irritated (Pitta high). This creates the classic cycle of: overthinking → acidity → poor sleep → low energy → more overthinking. Your body is trying to run fast while your inner system is overheating.",
      "whyFeelingLikeThis": "Irregular meals, high workload, emotional pressure, late nights, or skipping food under stress have pushed both Vata and Pitta up — but Vata is leading the imbalance.",
      "commonSymptoms": [
        "Anxiety + irritability together",
        "Gas, acidity, bloating",
        "Sudden drops in energy",
        "\"Brain running fast\" at night",
        "Headaches or burning in stomach",
        "Feeling overwhelmed by small things"
      ],
      "earlyWarningsTitle": "Early Warnings If This Continues",
      "earlyWarnings": "You may see: IBS-like symptoms, panic episodes, migraines, severe sleep disturbance.",
      "whatYourBodyNeeds": [
        "Eat warm meals on time — no skipping",
        "Reduce spicy + stimulants (tea/coffee)",
        "Slow down evening routine",
        "Practice 3–5 mins deep breathing before sleep"
      ],
      "closingMessage": "Your system needs rhythm — not more pressure."
    },
    "V5": {
      "title": "🌬🔥 Pyro–Aero Imbalance: \"The Overheated Wind Pattern\"",
      "subtitle": "(Pyro dominant — heat + restlessness)",
      "whatsHappening": "Your inner fire is running high, creating acidity, heat, irritability, and inflammation-like symptoms. Vata is rising too — making your thoughts faster and sleep lighter. You're running on intensity, not stability.",
      "whyFeelingLikeThis": "Deadlines, expectations, multitasking, long screen hours, late meals, and self-pressure have overactivated Pitta, and Vata rushed to follow.",
      "commonSymptoms": [
        "Acidity + gas at the same time",
        "Hunger that feels urgent",
        "Feeling irritated without clear reason",
        "Difficulty calming mind at night",
        "Light sleep + waking between 2–4 AM",
        "Heat in face, eyes, or chest"
      ],
      "earlyWarningsTitle": "Early Warnings If Ignored",
      "earlyWarnings": "Increasing Pitta + Vata can lead to: gastritis, burnout, chronic anxiety, hormonal heat issues.",
      "whatYourBodyNeeds": [
        "Cooling foods + warm, simple meals",
        "Reduce intense workouts for a while",
        "Keep caffeine low",
        "Add one calming ritual at night"
      ],
      "closingMessage": "Your body is asking you to cool down, not slow down."
    },
    "V6": {
      "title": "🔥🌧 Pyro–Geo Imbalance: \"The Stagnant Heat Pattern\"",
      "subtitle": "(Pyro dominant — heat + heaviness)",
      "whatsHappening": "Your digestive fire is irritated (Pitta high), but your metabolism and lymphatic system have slowed (Kapha high). This creates a \"hot on the inside, heavy on the outside\" imbalance. You may feel both inflamed and stuck at the same time.",
      "whyFeelingLikeThis": "Stress, overeating, heavy meals, sweet cravings, emotional pressure, or lack of movement have pushed Kapha upward — while Pitta reacts with heat and irritation.",
      "commonSymptoms": [
        "Acidity after heavy/oily meals",
        "Heaviness in mornings",
        "Afternoon sleepiness",
        "Irritability + frustration",
        "Water retention, puffiness",
        "Skin heat or breakouts"
      ],
      "earlyWarningsTitle": "Early Warnings If This Continues",
      "earlyWarnings": "Possibility of: blood sugar fluctuations, hormonal imbalance, chronic inflammation, weight that doesn't move easily.",
      "whatYourBodyNeeds": [
        "Light, warm meals — low on oil + spice",
        "20–30 mins movement daily",
        "Avoid emotional snacking",
        "Stay hydrated with warm water"
      ],
      "closingMessage": "You don't need to push more — you need to release what's weighing you down."
    },
    "V7": {
      "title": "🔥🌧 Geo–Pyro Imbalance: \"The Heavy Flame Pattern\"",
      "subtitle": "(Geo dominant — heaviness + internal heat)",
      "whatsHappening": "Your body is holding onto heaviness (Kapha high), while your inner fire is still active (Pitta rising). This creates a trapped, uncomfortable mix: tired body + restless heat + emotional overload. Your system feels stuck, yet irritated.",
      "whyFeelingLikeThis": "Worrying quietly, eating for comfort, overthinking without expressing emotions, or staying in stressful environments for too long triggers both Kapha and Pitta — but Kapha takes the lead.",
      "commonSymptoms": [
        "Heavy mornings + difficulty getting started",
        "Heartburn or acidity after meals",
        "Feeling emotionally \"full\" but unexpressed",
        "Cravings for sweets or cold foods",
        "Puffiness in face, fingers, or abdomen",
        "Feeling irritated but not wanting conflict"
      ],
      "earlyWarningsTitle": "Early Warnings If Ignored",
      "earlyWarnings": "This imbalance can push toward: low thyroid symptoms, stubborn weight gain, hormonal stagnation, emotional withdrawal.",
      "whatYourBodyNeeds": [
        "20–25 mins daily movement to release heaviness",
        "Warm, light meals — avoid cold, creamy, heavy foods",
        "Talk out emotions instead of storing them",
        "Limit late-night eating & scrolling"
      ],
      "closingMessage": "Your body is asking you to lighten the load you've been carrying quietly."
    },
    "V8": {
      "title": "🌬🌧 Aero–Geo Imbalance: \"The Cold–Damp Flow Pattern\"",
      "subtitle": "(Aero dominant — dryness + heaviness mix)",
      "whatsHappening": "Your mind is overstimulated (Vata high), but your body is moving slow (Kapha elevated). This creates a frustrating mismatch: you want to act, but your body doesn't move. Stress increases restlessness, and routine slows the body even more.",
      "whyFeelingLikeThis": "Irregular lifestyle, emotional holding, long sitting hours, cold meals, and overthinking have simultaneously raised Vata and Kapha — Vata faster.",
      "commonSymptoms": [
        "Anxiety mixed with procrastination",
        "Gas + sluggish digestion",
        "Unrefreshing sleep (sleeping long but waking tired)",
        "Feeling stuck, overwhelmed",
        "Difficulty starting tasks",
        "Sweet cravings during stress"
      ],
      "earlyWarningsTitle": "Early Warnings If Ignored",
      "earlyWarnings": "This pattern can lead to: chronic fatigue, emotional instability, digestive weakness, cycles of withdrawal + burnout.",
      "whatYourBodyNeeds": [
        "Gentle morning movement to wake both body & mind",
        "Warm meals spaced regularly",
        "60–90 mins daily \"screen-light\" time",
        "Break tasks into small steps — start slow but start"
      ],
      "closingMessage": "Your mind wants motion; your body needs rhythm. Meet them halfway."
    },
    "V9": {
      "title": "🌬🌧 Geo–Aero Imbalance: \"The Heavy Air Pattern\"",
      "subtitle": "(Geo dominant — heaviness + anxiety)",
      "whatsHappening": "Your body is slowing down (Geo high) while your mind holds quiet worry (Vata rising). You may look calm, but internally feel unsettled or emotionally overloaded. This creates low energy + low motivation + quiet tension.",
      "whyFeelingLikeThis": "Emotional suppression, long periods of inactivity, cold foods, oversleeping, irregular routines, or carrying responsibilities silently can raise Kapha — with Vata rising through worry.",
      "commonSymptoms": [
        "Heavy, slow mornings",
        "Persistent tiredness",
        "Overthinking but not acting",
        "Feeling lonely or disconnected",
        "Water retention, puffiness",
        "Comfort-eating or emotional snacking"
      ],
      "earlyWarningsTitle": "Early Warnings If Ignored",
      "earlyWarnings": "Long-term imbalance may lead to: weight gain, emotional dullness, lowered metabolism, anxiety episodes, sleep disturbances.",
      "whatYourBodyNeeds": [
        "Morning sunlight + movement",
        "Avoid emotional eating — choose warm, light meals",
        "Reduce long naps",
        "Talk to someone you trust — don't carry everything silently"
      ],
      "closingMessage": "You've been holding too much alone — let movement and warmth help you release."
    }
  }
}
